#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_RedButterfly

#include "Basic.hpp"

#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function ABP_RedButterfly.ABP_RedButterfly_C.ExecuteUbergraph_ABP_RedButterfly
// 0x000C (0x000C - 0x0000)
struct ABP_RedButterfly_C_ExecuteUbergraph_ABP_RedButterfly final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_RedButterfly_C_ExecuteUbergraph_ABP_RedButterfly;

// Function ABP_RedButterfly.ABP_RedButterfly_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_RedButterfly_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_RedButterfly_C_BlueprintUpdateAnimation;

// Function ABP_RedButterfly.ABP_RedButterfly_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_RedButterfly_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_RedButterfly_C_AnimGraph;

// Function ABP_RedButterfly.ABP_RedButterfly_C.AnimLayer_Additive
// 0x0030 (0x0030 - 0x0000)
struct ABP_RedButterfly_C_AnimLayer_Additive final
{
public:
	struct FPoseLink                              MainStateBasePose;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AdditivePose;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimLayer_Additive_0;                              // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_RedButterfly_C_AnimLayer_Additive;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
