#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_CH_PC_Pino

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_CH_PC_Pino.ABP_CH_PC_Pino_C
// 0x9460 (0x9AC0 - 0x0660)
class UABP_CH_PC_Pino_C final : public ULPCAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0660(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x0668(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_12;                   // 0x0780(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_11;                   // 0x08D8(0x0158)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x0A30(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x0A60(0x0118)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0B78(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x0BF8(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_10;                   // 0x0C98(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_25;                    // 0x0DF0(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x0E18(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_24;                    // 0x0EE0(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x0F08(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x0F38(0x0118)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;             // 0x1050(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;             // 0x1070(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x1090(0x0118)()
	uint8                                         Pad_11A8[0x8];                                     // 0x11A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_1;                      // 0x11B0(0x0440)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x15F0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x16F8(0x0108)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x1800(0x0440)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x1C40(0x0030)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x1C70(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x1C90(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x1CB0(0x0108)()
	uint8                                         Pad_1DB8[0x8];                                     // 0x1DB8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_1;                         // 0x1DC0(0x01E0)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0x1FA0(0x01E0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x2180(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x2288(0x0108)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x2390(0x0118)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x24A8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x24D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x2500(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x2528(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x2550(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_7;                  // 0x2578(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x2660(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x2690(0x0028)()
	struct FAnimNode_RandomPlayer                 AnimGraphNode_RandomPlayer_1;                      // 0x26B8(0x0078)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x2730(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x27F8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x2878(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x28A8(0x00B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x2958(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x2980(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x29A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x29D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x29F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x2A20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x2A48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x2A70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x2A98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x2AC0(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_6;                  // 0x2AE8(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x2BD0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x2C00(0x0028)()
	struct FAnimNode_RandomPlayer                 AnimGraphNode_RandomPlayer;                        // 0x2C28(0x0078)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x2CA0(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x2D68(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x2DE8(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_5;                  // 0x2E18(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x2F00(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_4;                  // 0x2F30(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x3018(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x3048(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x3130(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x3160(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_9;                    // 0x3210(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8;                    // 0x3368(0x0158)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x34C0(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_23;                    // 0x3560(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_22;                    // 0x3588(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_21;                    // 0x35B0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_20;                    // 0x35D8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7;                    // 0x3600(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0x3758(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x38B0(0x0158)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x3A08(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19;                    // 0x3B10(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0x3B38(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x3B60(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x3C10(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x3C38(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x3D90(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x3DB8(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x3E58(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_5;                  // 0x3EA0(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x3F60(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0x3F88(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x4048(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x4070(0x00A0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x4110(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x4158(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x4260(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x4280(0x0108)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x4388(0x00C0)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x4448(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x44F8(0x0028)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x4520(0x00A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x45C0(0x0108)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x46C8(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x46F0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x4710(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x4730(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x4838(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x4858(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x4878(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x48F8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x4920(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x4948(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x4970(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x49B8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x4B10(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x4B38(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x4B60(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x4C68(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x4D70(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x4D90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x4DB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x4DE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x4E08(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x4E30(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x4EB0(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x4EE0(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x4FC8(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x4FF8(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x50E0(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x5110(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x51F8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x5228(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x52D8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x5430(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x5458(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x5520(0x00C8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x55E8(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x5608(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x56A8(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x56D0(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x56F0(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x5F90(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x6830(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x70D0(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x7970(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x8210(0x08A0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x8AB0(0x08A0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x9350(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x9410(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x9440(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x9468(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x9490(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x9550(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x9578(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x96D0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x9718(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x9870(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x9898(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x98C0(0x00C0)()
	bool                                          bHasWeapon;                                        // 0x9980(0x0001)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          __CustomProperty_BHasWeapon_EA8731664B919553843708B36B069F15; // 0x9981(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9982[0x2];                                     // 0x9982(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              PCInputAxis;                                       // 0x9984(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_998C[0x4];                                     // 0x998C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLInverseKinemetic                     IK_Main;                                           // 0x9990(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRotator                               TEST_RopeLookAt;                                   // 0x99D0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         TEST_RopeLookAtAlpha;                              // 0x99DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Right;                                             // 0x99E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Front;                                             // 0x99E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKawaiiPhysicsSettings                 KP_Robe_Default;                                   // 0x99E8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 KP_Frill_Default;                                  // 0x9A00(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 KP_Hair;                                           // 0x9A18(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 KP_ACC_Default;                                    // 0x9A30(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 KP_Frill_02;                                       // 0x9A48(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 KP_Cloth_01;                                       // 0x9A60(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 KP_Frill_03;                                       // 0x9A78(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 KP_ACC_01;                                         // 0x9A90(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         Blend_Weights_0;                                   // 0x9AA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGuarding;                                        // 0x9AAC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9AAD[0x3];                                     // 0x9AAD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Cached_SlaveArm_Additive_Alpha;                    // 0x9AB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9AB4[0x4];                                     // 0x9AB4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      Cached_SlaveArm_Additive_Anim;                     // 0x9AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_CH_PC_Pino(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CH_PC_Pino_AnimGraphNode_TransitionResult_CE53E97B46E18C2B5D333FAF4205C54D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CH_PC_Pino_AnimGraphNode_TransitionResult_EE61E4714EBA6B683B6E9DA022226A81();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CH_PC_Pino_AnimGraphNode_TransitionResult_6E92EAAF4A107DD3F60538946D2C4200();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CH_PC_Pino_AnimGraphNode_TransitionResult_7D5F05D241F94B7BA940D39190E8EF2F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CH_PC_Pino_AnimGraphNode_TransitionResult_270191FA4C2DBC87382DDE9D5D03A1C0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CH_PC_Pino_AnimGraphNode_TransitionResult_844628984DAAB365909C5DBF8180C4C1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CH_PC_Pino_AnimGraphNode_TransitionResult_3FC6432043BBBF68DD156F8BB0C6BFB2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CH_PC_Pino_AnimGraphNode_TransitionResult_467A0C544D547C173D50B38682E9278E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CH_PC_Pino_AnimGraphNode_TransitionResult_82B1AABD4986D36548D57DB8448B5408();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CH_PC_Pino_AnimGraphNode_TransitionResult_8ECFB78045839598E11EAF8C6C01F19B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CH_PC_Pino_AnimGraphNode_TransitionResult_3D340D7C4E3DF2E2B44AC6AC0CDFAFFA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CH_PC_Pino_AnimGraphNode_TransitionResult_24B5B9D742F3C3D0FA608CB333E963EC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CH_PC_Pino_AnimGraphNode_TransitionResult_A6ADEF90469646A9A995D8AE18ADCD2F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CH_PC_Pino_AnimGraphNode_TransitionResult_2EE2D7E1465181FE8CD04D96E9BE8C2C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CH_PC_Pino_AnimGraphNode_TransitionResult_D415A7B442C8A06E7A99A9ABEAF95C50();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CH_PC_Pino_AnimGraphNode_TransitionResult_9F972CB6482C911D772DCBAA3BD0C3C4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CH_PC_Pino_AnimGraphNode_BlendListByBool_D3C917864F869B07C443B5A25466E30E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CH_PC_Pino_AnimGraphNode_ModifyBone_C9283D224EE3AB31E4B064A5133F19BE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CH_PC_Pino_AnimGraphNode_TwoBoneIK_F457AE2F4713D118A9C0A09308BC974A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CH_PC_Pino_AnimGraphNode_TwoBoneIK_883C0B5843E02F2BC2FA1A917E189FBE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CH_PC_Pino_AnimGraphNode_ModifyBone_BF54840248A1780A5E685EB0FB933198();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CH_PC_Pino_AnimGraphNode_ModifyBone_9432A70D4F3ACA294A3649BC0B790752();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CH_PC_Pino_AnimGraphNode_ModifyBone_EF4FF55A4FDC174A5FB5BB9DC36DC6FB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CH_PC_Pino_AnimGraphNode_ModifyBone_BE5DD3464696FBCAC0D43A989DCE86BF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_CH_PC_Pino_AnimGraphNode_ModifyBone_621AA4F34D353B197D7BA38FA9E385F4();
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimLayer_FootIK(const struct FPoseLink& InPose, struct FPoseLink* AnimLayer_FootIK_0);
	void AnimLayer_Accessory(const struct FPoseLink& InPose_0, struct FPoseLink* AnimLayer_Accessory_0);
	void AnimLayer_HasWeapon(const struct FPoseLink& HasWeaponPose, bool bHasWeapon_0, struct FPoseLink* AnimLayer_HasWeapon_0);
	void AnimLayer_Additive(const struct FPoseLink& MainStateBasePose, const struct FPoseLink& AdditivePose, struct FPoseLink* AnimLayer_Additive_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_CH_PC_Pino_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_CH_PC_Pino_C")
	}
	static class UABP_CH_PC_Pino_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_CH_PC_Pino_C>();
	}
};
DUMPER7_ASSERTS_UABP_CH_PC_Pino_C;

SDK_NAMESPACE_END
