#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BGM_Struct

#include "Basic.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct BGM_Struct.BGM_Struct
// 0x0040 (0x0040 - 0x0000)
struct FBGM_Struct final
{
public:
	class FName                                   SoundName_2_5C53B9344BC82B5A9FFB91995B2443BE;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                              SoundCue_5_48BC42B743ED91532D68338A6257A38F;       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   SoundLocalizeName_18_16E22FD24273DCDAD621E8BEA6CD9A9A; // 0x0010(0x0018)(Edit, BlueprintVisible)
	TArray<class FName>                           BossCodeNameList_27_705891004CD7AD9AEC85A9A8B222696F; // 0x0028(0x0010)(Edit, BlueprintVisible)
	class FName                                   SoundGameString_23_AD8CE5D84B547C0339E091B587662FA5; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FBGM_Struct;

SDK_NAMESPACE_END
