#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Projectile_Fixed_Base

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_Projectile_Fixed_Base.BP_Projectile_Fixed_Base_C.ExecuteUbergraph_BP_Projectile_Fixed_Base
// 0x0020 (0x0020 - 0x0000)
struct BP_Projectile_Fixed_Base_C_ExecuteUbergraph_BP_Projectile_Fixed_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELProjectileDestroyReason                     K2Node_Event_Reason_1;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELProjectileDestroyReason                     K2Node_Event_Reason;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Projectile_Design_Base_C*           K2Node_DynamicCast_AsBP_Projectile_Design_Base;    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Projectile_Fixed_Base_C_ExecuteUbergraph_BP_Projectile_Fixed_Base;

// Function BP_Projectile_Fixed_Base.BP_Projectile_Fixed_Base_C.OnDisappear
// 0x0001 (0x0001 - 0x0000)
struct BP_Projectile_Fixed_Base_C_OnDisappear final
{
public:
	ELProjectileDestroyReason                     Reason;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Projectile_Fixed_Base_C_OnDisappear;

// Function BP_Projectile_Fixed_Base.BP_Projectile_Fixed_Base_C.OnExplode
// 0x0001 (0x0001 - 0x0000)
struct BP_Projectile_Fixed_Base_C_OnExplode final
{
public:
	ELProjectileDestroyReason                     Reason;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Projectile_Fixed_Base_C_OnExplode;

// Function BP_Projectile_Fixed_Base.BP_Projectile_Fixed_Base_C.FinishProjectile
// 0x0018 (0x0018 - 0x0000)
struct BP_Projectile_Fixed_Base_C_FinishProjectile final
{
public:
	class ULObjectPoolSystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ReturnToRecyclingBin_ReturnValue;         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_CollisionProfile_NoCollision_ReturnValue; // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Projectile_Fixed_Base_C_FinishProjectile;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
