#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EasyParticle

#include "Basic.hpp"

#include "EasyParticle_structs.hpp"
#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function EasyParticle.EasyParticle.SetPlayParticle
// 0x0001 (0x0001 - 0x0000)
struct EasyParticle_SetPlayParticle final
{
public:
	bool                                          InPlayParticle;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EasyParticle_SetPlayParticle;

// Function EasyParticle.EasyParticleComponent.CreateRuntimeComponent
// 0x0008 (0x0008 - 0x0000)
struct EasyParticleComponent_CreateRuntimeComponent final
{
public:
	class UEasyParticleComponentRuntime*          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EasyParticleComponent_CreateRuntimeComponent;

// Function EasyParticle.EasyParticleComponent.GetPriority
// 0x0001 (0x0001 - 0x0000)
struct EasyParticleComponent_GetPriority final
{
public:
	EComponentPriority                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EasyParticleComponent_GetPriority;

// Function EasyParticle.EasyParticleComponent.GetTypeName
// 0x0010 (0x0010 - 0x0000)
struct EasyParticleComponent_GetTypeName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EasyParticleComponent_GetTypeName;

// Function EasyParticle.EasyParticleComponentRuntime.Init
// 0x0038 (0x0038 - 0x0000)
struct EasyParticleComponentRuntime_Init final
{
public:
	struct FGeometry                              AllottedGeometry;                                  // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EasyParticleComponentRuntime_Init;

// Function EasyParticle.EasyParticleComponentRuntime.PostTick
// 0x003C (0x003C - 0x0000)
struct EasyParticleComponentRuntime_PostTick final
{
public:
	struct FGeometry                              AllottedGeometry;                                  // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EasyParticleComponentRuntime_PostTick;

// Function EasyParticle.EasyParticleComponentRuntime.Tick
// 0x003C (0x003C - 0x0000)
struct EasyParticleComponentRuntime_Tick final
{
public:
	struct FGeometry                              AllottedGeometry;                                  // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EasyParticleComponentRuntime_Tick;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
