#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EasyParticle

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "EasyParticle_structs.hpp"


SDK_NAMESPACE_START

// Class EasyParticle.EasyParticle
// 0x0030 (0x0138 - 0x0108)
class UEasyParticle final : public UWidget
{
public:
	class UEasyParticleAsset*                     Asset;                                             // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              EventOnEnd;                                        // 0x0110(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         bPlayParticle : 1;                                 // 0x0120(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	bool                                          IsPlaying;                                         // 0x0121(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_122[0x16];                                     // 0x0122(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Play();
	void SetPlayParticle(bool InPlayParticle);
	void Stop();
	void StopEmit();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticle")
	}
	static class UEasyParticle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticle>();
	}
};
DUMPER7_ASSERTS_UEasyParticle;

// Class EasyParticle.EasyParticleEmitterAsset
// 0x0010 (0x0038 - 0x0028)
class UEasyParticleEmitterAsset final : public UObject
{
public:
	TArray<class UEasyParticleComponent*>         Components;                                        // 0x0028(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleEmitterAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleEmitterAsset")
	}
	static class UEasyParticleEmitterAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleEmitterAsset>();
	}
};
DUMPER7_ASSERTS_UEasyParticleEmitterAsset;

// Class EasyParticle.EasyParticleAsset
// 0x0010 (0x0038 - 0x0028)
class UEasyParticleAsset final : public UObject
{
public:
	TArray<class UEasyParticleEmitterAsset*>      Emitters;                                          // 0x0028(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleAsset")
	}
	static class UEasyParticleAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleAsset>();
	}
};
DUMPER7_ASSERTS_UEasyParticleAsset;

// Class EasyParticle.EasyParticleComponent
// 0x0028 (0x0050 - 0x0028)
class UEasyParticleComponent : public UObject
{
public:
	bool                                          Active;                                            // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UEasyParticleComponentRuntime> RuntimeClass;                                   // 0x0030(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 TypeName;                                          // 0x0038(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EComponentPriority                            Priority;                                          // 0x0048(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UEasyParticleComponentRuntime* CreateRuntimeComponent();
	EComponentPriority GetPriority();
	class FString GetTypeName();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent")
	}
	static class UEasyParticleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent;

// Class EasyParticle.EasyParticleComponentRuntime
// 0x0010 (0x0038 - 0x0028)
class UEasyParticleComponentRuntime : public UObject
{
public:
	class UEasyParticleComponent*                 ParentAsset;                                       // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEasyParticleState*                     Owner;                                             // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void Init(const struct FGeometry& AllottedGeometry);
	void PostTick(const struct FGeometry& AllottedGeometry, const float InDeltaTime);
	void Reset();
	void Tick(const struct FGeometry& AllottedGeometry, const float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponentRuntime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponentRuntime")
	}
	static class UEasyParticleComponentRuntime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponentRuntime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponentRuntime;

// Class EasyParticle.EasyParticleComponent_Acceleration
// 0x01A8 (0x01F8 - 0x0050)
class UEasyParticleComponent_Acceleration final : public UEasyParticleComponent
{
public:
	struct FEasyParticlePropertyFloat             Acceleration;                                      // 0x0050(0x01A8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_Acceleration")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_Acceleration")
	}
	static class UEasyParticleComponent_Acceleration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_Acceleration>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_Acceleration;

// Class EasyParticle.EasyParticleComponent_Acceleration_Runtime
// 0x0008 (0x0040 - 0x0038)
class UEasyParticleComponent_Acceleration_Runtime final : public UEasyParticleComponentRuntime
{
public:
	struct FUIParticleRandomFactor                Factor;                                            // 0x0038(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_Acceleration_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_Acceleration_Runtime")
	}
	static class UEasyParticleComponent_Acceleration_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_Acceleration_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_Acceleration_Runtime;

// Class EasyParticle.EasyParticleComponent_AdditionPositionOffset
// 0x04F8 (0x0548 - 0x0050)
class UEasyParticleComponent_AdditionPositionOffset final : public UEasyParticleComponent
{
public:
	struct FEasyParticlePropertyFloat             InitialTime;                                       // 0x0050(0x01A8)(Edit, NativeAccessSpecifierPublic)
	struct FEasyParticlePropertyFloat             Frequency;                                         // 0x01F8(0x01A8)(Edit, NativeAccessSpecifierPublic)
	struct FEasyParticlePropertyFloat             Amplitude;                                         // 0x03A0(0x01A8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_AdditionPositionOffset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_AdditionPositionOffset")
	}
	static class UEasyParticleComponent_AdditionPositionOffset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_AdditionPositionOffset>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_AdditionPositionOffset;

// Class EasyParticle.EasyParticleComponent_AdditionPositionOffset_Runtime
// 0x0010 (0x0048 - 0x0038)
class UEasyParticleComponent_AdditionPositionOffset_Runtime final : public UEasyParticleComponentRuntime
{
public:
	struct FUIParticleRandomFactor                FactorInitialTime;                                 // 0x0038(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FUIParticleRandomFactor                FactorFrequency;                                   // 0x003C(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FUIParticleRandomFactor                FactorAmplitude;                                   // 0x0040(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_AdditionPositionOffset_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_AdditionPositionOffset_Runtime")
	}
	static class UEasyParticleComponent_AdditionPositionOffset_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_AdditionPositionOffset_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_AdditionPositionOffset_Runtime;

// Class EasyParticle.EasyParticleComponent_Basic
// 0x0508 (0x0558 - 0x0050)
class UEasyParticleComponent_Basic final : public UEasyParticleComponent
{
public:
	class UObject*                                ResourceObject;                                    // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EmitSeconds;                                       // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEasyParticlePropertyFloat             MaxParticleCount;                                  // 0x0060(0x01A8)(Edit, NativeAccessSpecifierPublic)
	struct FEasyParticlePropertyFloat             SpawnRate;                                         // 0x0208(0x01A8)(Edit, NativeAccessSpecifierPublic)
	struct FEasyParticlePropertyFloat             Lifetime;                                          // 0x03B0(0x01A8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_Basic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_Basic")
	}
	static class UEasyParticleComponent_Basic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_Basic>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_Basic;

// Class EasyParticle.EasyParticleComponent_Basic_Runtime
// 0x0010 (0x0048 - 0x0038)
class UEasyParticleComponent_Basic_Runtime final : public UEasyParticleComponentRuntime
{
public:
	struct FUIParticleRandomFactor                MaxParticleCountFactor;                            // 0x0038(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FUIParticleRandomFactor                SpawnRateFactor;                                   // 0x003C(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FUIParticleRandomFactor                LifetimeFactor;                                    // 0x0040(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_Basic_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_Basic_Runtime")
	}
	static class UEasyParticleComponent_Basic_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_Basic_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_Basic_Runtime;

// Class EasyParticle.EasyParticleComponent_Child
// 0x0010 (0x0060 - 0x0050)
class UEasyParticleComponent_Child final : public UEasyParticleComponent
{
public:
	class UEasyParticleAsset*                     Asset;                                             // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActiveParentLifePercent;                           // 0x0058(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_Child")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_Child")
	}
	static class UEasyParticleComponent_Child* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_Child>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_Child;

// Class EasyParticle.EasyParticleComponent_Child_Runtime
// 0x0018 (0x0050 - 0x0038)
class UEasyParticleComponent_Child_Runtime final : public UEasyParticleComponentRuntime
{
public:
	TArray<struct FEasyParticleComponentRuntime_Child_SubEmitter> ChildEmitterArray;                 // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          StopCreateParticle;                                // 0x0048(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_Child_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_Child_Runtime")
	}
	static class UEasyParticleComponent_Child_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_Child_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_Child_Runtime;

// Class EasyParticle.EasyParticleComponent_Color
// 0x0660 (0x06B0 - 0x0050)
class UEasyParticleComponent_Color final : public UEasyParticleComponent
{
public:
	struct FEasyParticlePropertyColor             InitialColor;                                      // 0x0050(0x0660)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_Color")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_Color")
	}
	static class UEasyParticleComponent_Color* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_Color>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_Color;

// Class EasyParticle.EasyParticleComponent_Color_Runtime
// 0x0010 (0x0048 - 0x0038)
class UEasyParticleComponent_Color_Runtime final : public UEasyParticleComponentRuntime
{
public:
	struct FUIParticleRandomFactor                FactorR;                                           // 0x0038(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FUIParticleRandomFactor                FactorG;                                           // 0x003C(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FUIParticleRandomFactor                FactorB;                                           // 0x0040(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FUIParticleRandomFactor                FactorA;                                           // 0x0044(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_Color_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_Color_Runtime")
	}
	static class UEasyParticleComponent_Color_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_Color_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_Color_Runtime;

// Class EasyParticle.EasyParticleComponent_DelayActive
// 0x01A8 (0x01F8 - 0x0050)
class UEasyParticleComponent_DelayActive final : public UEasyParticleComponent
{
public:
	struct FEasyParticlePropertyFloat             Value;                                             // 0x0050(0x01A8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_DelayActive")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_DelayActive")
	}
	static class UEasyParticleComponent_DelayActive* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_DelayActive>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_DelayActive;

// Class EasyParticle.EasyParticleComponent_DelayActive_Runtime
// 0x0008 (0x0040 - 0x0038)
class UEasyParticleComponent_DelayActive_Runtime final : public UEasyParticleComponentRuntime
{
public:
	struct FUIParticleRandomFactor                Factor;                                            // 0x0038(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_DelayActive_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_DelayActive_Runtime")
	}
	static class UEasyParticleComponent_DelayActive_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_DelayActive_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_DelayActive_Runtime;

// Class EasyParticle.EasyParticleComponent_FollowParentPosition
// 0x0000 (0x0050 - 0x0050)
class UEasyParticleComponent_FollowParentPosition final : public UEasyParticleComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_FollowParentPosition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_FollowParentPosition")
	}
	static class UEasyParticleComponent_FollowParentPosition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_FollowParentPosition>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_FollowParentPosition;

// Class EasyParticle.EasyParticleComponent_FollowParentPosition_Runtime
// 0x0000 (0x0038 - 0x0038)
class UEasyParticleComponent_FollowParentPosition_Runtime final : public UEasyParticleComponentRuntime
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_FollowParentPosition_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_FollowParentPosition_Runtime")
	}
	static class UEasyParticleComponent_FollowParentPosition_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_FollowParentPosition_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_FollowParentPosition_Runtime;

// Class EasyParticle.EasyParticleComponent_Gravity
// 0x0350 (0x03A0 - 0x0050)
class UEasyParticleComponent_Gravity final : public UEasyParticleComponent
{
public:
	struct FEasyParticlePropertyFloat             GravityX;                                          // 0x0050(0x01A8)(Edit, NativeAccessSpecifierPublic)
	struct FEasyParticlePropertyFloat             GravityY;                                          // 0x01F8(0x01A8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_Gravity")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_Gravity")
	}
	static class UEasyParticleComponent_Gravity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_Gravity>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_Gravity;

// Class EasyParticle.EasyParticleComponent_Gravity_Runtime
// 0x0008 (0x0040 - 0x0038)
class UEasyParticleComponent_Gravity_Runtime final : public UEasyParticleComponentRuntime
{
public:
	struct FUIParticleRandomFactor                FactorX;                                           // 0x0038(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FUIParticleRandomFactor                FactorY;                                           // 0x003C(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_Gravity_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_Gravity_Runtime")
	}
	static class UEasyParticleComponent_Gravity_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_Gravity_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_Gravity_Runtime;

// Class EasyParticle.EasyParticleComponent_InheritParentVelocity
// 0x0008 (0x0058 - 0x0050)
class UEasyParticleComponent_InheritParentVelocity final : public UEasyParticleComponent
{
public:
	float                                         Percent;                                           // 0x0050(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InheritParentVelocity")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InheritParentVelocity")
	}
	static class UEasyParticleComponent_InheritParentVelocity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InheritParentVelocity>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InheritParentVelocity;

// Class EasyParticle.EasyParticleComponent_InheritParentVelocity_Runtime
// 0x0000 (0x0038 - 0x0038)
class UEasyParticleComponent_InheritParentVelocity_Runtime final : public UEasyParticleComponentRuntime
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InheritParentVelocity_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InheritParentVelocity_Runtime")
	}
	static class UEasyParticleComponent_InheritParentVelocity_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InheritParentVelocity_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InheritParentVelocity_Runtime;

// Class EasyParticle.EasyParticleComponent_InitialColor
// 0x0660 (0x06B0 - 0x0050)
class UEasyParticleComponent_InitialColor final : public UEasyParticleComponent
{
public:
	struct FEasyParticlePropertyColor             InitialColor;                                      // 0x0050(0x0660)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InitialColor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InitialColor")
	}
	static class UEasyParticleComponent_InitialColor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InitialColor>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InitialColor;

// Class EasyParticle.EasyParticleComponent_InitialColor_Runtime
// 0x0010 (0x0048 - 0x0038)
class UEasyParticleComponent_InitialColor_Runtime final : public UEasyParticleComponentRuntime
{
public:
	struct FUIParticleRandomFactor                FactorR;                                           // 0x0038(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FUIParticleRandomFactor                FactorG;                                           // 0x003C(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FUIParticleRandomFactor                FactorB;                                           // 0x0040(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FUIParticleRandomFactor                FactorA;                                           // 0x0044(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InitialColor_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InitialColor_Runtime")
	}
	static class UEasyParticleComponent_InitialColor_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InitialColor_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InitialColor_Runtime;

// Class EasyParticle.EasyParticleComponent_InitialDrawEffect
// 0x0008 (0x0058 - 0x0050)
class UEasyParticleComponent_InitialDrawEffect final : public UEasyParticleComponent
{
public:
	EEasyParticleDrawEffect                       DrawEffect;                                        // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InitialDrawEffect")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InitialDrawEffect")
	}
	static class UEasyParticleComponent_InitialDrawEffect* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InitialDrawEffect>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InitialDrawEffect;

// Class EasyParticle.EasyParticleComponent_InitialDrawEffect_Runtime
// 0x0000 (0x0038 - 0x0038)
class UEasyParticleComponent_InitialDrawEffect_Runtime final : public UEasyParticleComponentRuntime
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InitialDrawEffect_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InitialDrawEffect_Runtime")
	}
	static class UEasyParticleComponent_InitialDrawEffect_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InitialDrawEffect_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InitialDrawEffect_Runtime;

// Class EasyParticle.EasyParticleComponent_InitialPivot
// 0x0350 (0x03A0 - 0x0050)
class UEasyParticleComponent_InitialPivot final : public UEasyParticleComponent
{
public:
	struct FEasyParticlePropertyFloat             InitialPivotX;                                     // 0x0050(0x01A8)(Edit, NativeAccessSpecifierPublic)
	struct FEasyParticlePropertyFloat             InitialPivotY;                                     // 0x01F8(0x01A8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InitialPivot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InitialPivot")
	}
	static class UEasyParticleComponent_InitialPivot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InitialPivot>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InitialPivot;

// Class EasyParticle.EasyParticleComponent_InitialPivot_Runtime
// 0x0008 (0x0040 - 0x0038)
class UEasyParticleComponent_InitialPivot_Runtime final : public UEasyParticleComponentRuntime
{
public:
	struct FUIParticleRandomFactor                FactorX;                                           // 0x0038(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FUIParticleRandomFactor                FactorY;                                           // 0x003C(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InitialPivot_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InitialPivot_Runtime")
	}
	static class UEasyParticleComponent_InitialPivot_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InitialPivot_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InitialPivot_Runtime;

// Class EasyParticle.EasyParticleComponent_InitialPosition
// 0x0350 (0x03A0 - 0x0050)
class UEasyParticleComponent_InitialPosition final : public UEasyParticleComponent
{
public:
	struct FEasyParticlePropertyFloat             InitialPositionX;                                  // 0x0050(0x01A8)(Edit, NativeAccessSpecifierPublic)
	struct FEasyParticlePropertyFloat             InitialPositionY;                                  // 0x01F8(0x01A8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InitialPosition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InitialPosition")
	}
	static class UEasyParticleComponent_InitialPosition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InitialPosition>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InitialPosition;

// Class EasyParticle.EasyParticleComponent_InitialPosition_Runtime
// 0x0008 (0x0040 - 0x0038)
class UEasyParticleComponent_InitialPosition_Runtime final : public UEasyParticleComponentRuntime
{
public:
	struct FUIParticleRandomFactor                FactorX;                                           // 0x0038(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FUIParticleRandomFactor                FactorY;                                           // 0x003C(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InitialPosition_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InitialPosition_Runtime")
	}
	static class UEasyParticleComponent_InitialPosition_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InitialPosition_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InitialPosition_Runtime;

// Class EasyParticle.EasyParticleComponent_InitialPosition_AutoSize
// 0x0000 (0x0050 - 0x0050)
class UEasyParticleComponent_InitialPosition_AutoSize final : public UEasyParticleComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InitialPosition_AutoSize")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InitialPosition_AutoSize")
	}
	static class UEasyParticleComponent_InitialPosition_AutoSize* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InitialPosition_AutoSize>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InitialPosition_AutoSize;

// Class EasyParticle.EasyParticleComponent_InitialPosition_AutoSize_Runtime
// 0x0008 (0x0040 - 0x0038)
class UEasyParticleComponent_InitialPosition_AutoSize_Runtime final : public UEasyParticleComponentRuntime
{
public:
	struct FUIParticleRandomFactor                FactorX;                                           // 0x0038(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FUIParticleRandomFactor                FactorY;                                           // 0x003C(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InitialPosition_AutoSize_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InitialPosition_AutoSize_Runtime")
	}
	static class UEasyParticleComponent_InitialPosition_AutoSize_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InitialPosition_AutoSize_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InitialPosition_AutoSize_Runtime;

// Class EasyParticle.EasyParticleComponent_InitialRotation
// 0x01A8 (0x01F8 - 0x0050)
class UEasyParticleComponent_InitialRotation final : public UEasyParticleComponent
{
public:
	struct FEasyParticlePropertyFloat             InitialRotation;                                   // 0x0050(0x01A8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InitialRotation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InitialRotation")
	}
	static class UEasyParticleComponent_InitialRotation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InitialRotation>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InitialRotation;

// Class EasyParticle.EasyParticleComponent_InitialRotation_Runtime
// 0x0008 (0x0040 - 0x0038)
class UEasyParticleComponent_InitialRotation_Runtime final : public UEasyParticleComponentRuntime
{
public:
	struct FUIParticleRandomFactor                Factor;                                            // 0x0038(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InitialRotation_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InitialRotation_Runtime")
	}
	static class UEasyParticleComponent_InitialRotation_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InitialRotation_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InitialRotation_Runtime;

// Class EasyParticle.EasyParticleComponent_InitialRotationRate
// 0x01A8 (0x01F8 - 0x0050)
class UEasyParticleComponent_InitialRotationRate final : public UEasyParticleComponent
{
public:
	struct FEasyParticlePropertyFloat             InitialRotationRate;                               // 0x0050(0x01A8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InitialRotationRate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InitialRotationRate")
	}
	static class UEasyParticleComponent_InitialRotationRate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InitialRotationRate>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InitialRotationRate;

// Class EasyParticle.EasyParticleComponent_InitialRotationRate_Runtime
// 0x0008 (0x0040 - 0x0038)
class UEasyParticleComponent_InitialRotationRate_Runtime final : public UEasyParticleComponentRuntime
{
public:
	struct FUIParticleRandomFactor                Factor;                                            // 0x0038(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InitialRotationRate_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InitialRotationRate_Runtime")
	}
	static class UEasyParticleComponent_InitialRotationRate_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InitialRotationRate_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InitialRotationRate_Runtime;

// Class EasyParticle.EasyParticleComponent_InitialSize
// 0x01A8 (0x01F8 - 0x0050)
class UEasyParticleComponent_InitialSize final : public UEasyParticleComponent
{
public:
	struct FEasyParticlePropertyFloat             InitialSize;                                       // 0x0050(0x01A8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InitialSize")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InitialSize")
	}
	static class UEasyParticleComponent_InitialSize* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InitialSize>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InitialSize;

// Class EasyParticle.EasyParticleComponent_InitialSize_Runtime
// 0x0008 (0x0040 - 0x0038)
class UEasyParticleComponent_InitialSize_Runtime final : public UEasyParticleComponentRuntime
{
public:
	struct FUIParticleRandomFactor                Factor;                                            // 0x0038(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InitialSize_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InitialSize_Runtime")
	}
	static class UEasyParticleComponent_InitialSize_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InitialSize_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InitialSize_Runtime;

// Class EasyParticle.EasyParticleComponent_InitialSize_AutoSize
// 0x0010 (0x0060 - 0x0050)
class UEasyParticleComponent_InitialSize_AutoSize final : public UEasyParticleComponent
{
public:
	bool                                          ScaleByX;                                          // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              DesignSize;                                        // 0x0054(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InitialSize_AutoSize")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InitialSize_AutoSize")
	}
	static class UEasyParticleComponent_InitialSize_AutoSize* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InitialSize_AutoSize>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InitialSize_AutoSize;

// Class EasyParticle.EasyParticleComponent_InitialSize_AutoSize_Runtime
// 0x0000 (0x0038 - 0x0038)
class UEasyParticleComponent_InitialSize_AutoSize_Runtime final : public UEasyParticleComponentRuntime
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InitialSize_AutoSize_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InitialSize_AutoSize_Runtime")
	}
	static class UEasyParticleComponent_InitialSize_AutoSize_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InitialSize_AutoSize_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InitialSize_AutoSize_Runtime;

// Class EasyParticle.EasyParticleComponent_InitialSizeXY
// 0x0350 (0x03A0 - 0x0050)
class UEasyParticleComponent_InitialSizeXY final : public UEasyParticleComponent
{
public:
	struct FEasyParticlePropertyFloat             InitialSizeX;                                      // 0x0050(0x01A8)(Edit, NativeAccessSpecifierPublic)
	struct FEasyParticlePropertyFloat             InitialSizeY;                                      // 0x01F8(0x01A8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InitialSizeXY")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InitialSizeXY")
	}
	static class UEasyParticleComponent_InitialSizeXY* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InitialSizeXY>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InitialSizeXY;

// Class EasyParticle.EasyParticleComponent_InitialSizeXY_Runtime
// 0x0008 (0x0040 - 0x0038)
class UEasyParticleComponent_InitialSizeXY_Runtime final : public UEasyParticleComponentRuntime
{
public:
	struct FUIParticleRandomFactor                FactorX;                                           // 0x0038(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FUIParticleRandomFactor                FactorY;                                           // 0x003C(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InitialSizeXY_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InitialSizeXY_Runtime")
	}
	static class UEasyParticleComponent_InitialSizeXY_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InitialSizeXY_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InitialSizeXY_Runtime;

// Class EasyParticle.EasyParticleComponent_InitialVelocity
// 0x0350 (0x03A0 - 0x0050)
class UEasyParticleComponent_InitialVelocity final : public UEasyParticleComponent
{
public:
	struct FEasyParticlePropertyFloat             InitialVelocity;                                   // 0x0050(0x01A8)(Edit, NativeAccessSpecifierPublic)
	struct FEasyParticlePropertyFloat             InitialVelocityDirection;                          // 0x01F8(0x01A8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InitialVelocity")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InitialVelocity")
	}
	static class UEasyParticleComponent_InitialVelocity* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InitialVelocity>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InitialVelocity;

// Class EasyParticle.EasyParticleComponent_InitialVelocity_Runtime
// 0x0008 (0x0040 - 0x0038)
class UEasyParticleComponent_InitialVelocity_Runtime final : public UEasyParticleComponentRuntime
{
public:
	struct FUIParticleRandomFactor                FactorSpeed;                                       // 0x0038(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FUIParticleRandomFactor                FactorDirection;                                   // 0x003C(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InitialVelocity_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InitialVelocity_Runtime")
	}
	static class UEasyParticleComponent_InitialVelocity_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InitialVelocity_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InitialVelocity_Runtime;

// Class EasyParticle.EasyParticleComponent_InitialZOrderOffset
// 0x01A8 (0x01F8 - 0x0050)
class UEasyParticleComponent_InitialZOrderOffset final : public UEasyParticleComponent
{
public:
	struct FEasyParticlePropertyFloat             InitialZOrderOffset;                               // 0x0050(0x01A8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InitialZOrderOffset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InitialZOrderOffset")
	}
	static class UEasyParticleComponent_InitialZOrderOffset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InitialZOrderOffset>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InitialZOrderOffset;

// Class EasyParticle.EasyParticleComponent_InitialZOrderOffset_Runtime
// 0x0008 (0x0040 - 0x0038)
class UEasyParticleComponent_InitialZOrderOffset_Runtime final : public UEasyParticleComponentRuntime
{
public:
	struct FUIParticleRandomFactor                Factor;                                            // 0x0038(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_InitialZOrderOffset_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_InitialZOrderOffset_Runtime")
	}
	static class UEasyParticleComponent_InitialZOrderOffset_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_InitialZOrderOffset_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_InitialZOrderOffset_Runtime;

// Class EasyParticle.EasyParticleComponent_Orbit
// 0x04F8 (0x0548 - 0x0050)
class UEasyParticleComponent_Orbit final : public UEasyParticleComponent
{
public:
	struct FEasyParticlePropertyFloat             InitialRotation;                                   // 0x0050(0x01A8)(Edit, NativeAccessSpecifierPublic)
	struct FEasyParticlePropertyFloat             Radius;                                            // 0x01F8(0x01A8)(Edit, NativeAccessSpecifierPublic)
	struct FEasyParticlePropertyFloat             RotationRate;                                      // 0x03A0(0x01A8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_Orbit")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_Orbit")
	}
	static class UEasyParticleComponent_Orbit* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_Orbit>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_Orbit;

// Class EasyParticle.EasyParticleComponent_Orbit_Runtime
// 0x0010 (0x0048 - 0x0038)
class UEasyParticleComponent_Orbit_Runtime final : public UEasyParticleComponentRuntime
{
public:
	struct FUIParticleRandomFactor                FactorInitialRotation;                             // 0x0038(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FUIParticleRandomFactor                FactorRadius;                                      // 0x003C(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FUIParticleRandomFactor                FactorRotationRate;                                // 0x0040(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_Orbit_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_Orbit_Runtime")
	}
	static class UEasyParticleComponent_Orbit_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_Orbit_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_Orbit_Runtime;

// Class EasyParticle.EasyParticleComponent_RadialAcceleration
// 0x01A8 (0x01F8 - 0x0050)
class UEasyParticleComponent_RadialAcceleration final : public UEasyParticleComponent
{
public:
	struct FEasyParticlePropertyFloat             RadialAcceleration;                                // 0x0050(0x01A8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_RadialAcceleration")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_RadialAcceleration")
	}
	static class UEasyParticleComponent_RadialAcceleration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_RadialAcceleration>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_RadialAcceleration;

// Class EasyParticle.EasyParticleComponent_RadialAcceleration_Runtime
// 0x0008 (0x0040 - 0x0038)
class UEasyParticleComponent_RadialAcceleration_Runtime final : public UEasyParticleComponentRuntime
{
public:
	struct FUIParticleRandomFactor                Factor;                                            // 0x0038(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_RadialAcceleration_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_RadialAcceleration_Runtime")
	}
	static class UEasyParticleComponent_RadialAcceleration_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_RadialAcceleration_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_RadialAcceleration_Runtime;

// Class EasyParticle.EasyParticleComponent_RotationRate
// 0x01A8 (0x01F8 - 0x0050)
class UEasyParticleComponent_RotationRate final : public UEasyParticleComponent
{
public:
	struct FEasyParticlePropertyFloat             RotationRate;                                      // 0x0050(0x01A8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_RotationRate")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_RotationRate")
	}
	static class UEasyParticleComponent_RotationRate* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_RotationRate>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_RotationRate;

// Class EasyParticle.EasyParticleComponent_RotationRate_Runtime
// 0x0008 (0x0040 - 0x0038)
class UEasyParticleComponent_RotationRate_Runtime final : public UEasyParticleComponentRuntime
{
public:
	struct FUIParticleRandomFactor                Factor;                                            // 0x0038(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_RotationRate_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_RotationRate_Runtime")
	}
	static class UEasyParticleComponent_RotationRate_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_RotationRate_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_RotationRate_Runtime;

// Class EasyParticle.EasyParticleComponent_RotationToVelocityDirection
// 0x0000 (0x0050 - 0x0050)
class UEasyParticleComponent_RotationToVelocityDirection final : public UEasyParticleComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_RotationToVelocityDirection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_RotationToVelocityDirection")
	}
	static class UEasyParticleComponent_RotationToVelocityDirection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_RotationToVelocityDirection>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_RotationToVelocityDirection;

// Class EasyParticle.EasyParticleComponent_RotationToVelocityDirection_Runtime
// 0x0000 (0x0038 - 0x0038)
class UEasyParticleComponent_RotationToVelocityDirection_Runtime final : public UEasyParticleComponentRuntime
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_RotationToVelocityDirection_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_RotationToVelocityDirection_Runtime")
	}
	static class UEasyParticleComponent_RotationToVelocityDirection_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_RotationToVelocityDirection_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_RotationToVelocityDirection_Runtime;

// Class EasyParticle.EasyParticleComponent_ScalarParam
// 0x01B0 (0x0200 - 0x0050)
class UEasyParticleComponent_ScalarParam final : public UEasyParticleComponent
{
public:
	class FName                                   ScalarParamName;                                   // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FEasyParticlePropertyFloat             Value;                                             // 0x0058(0x01A8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_ScalarParam")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_ScalarParam")
	}
	static class UEasyParticleComponent_ScalarParam* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_ScalarParam>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_ScalarParam;

// Class EasyParticle.EasyParticleComponent_ScalarParam_Runtime
// 0x0008 (0x0040 - 0x0038)
class UEasyParticleComponent_ScalarParam_Runtime final : public UEasyParticleComponentRuntime
{
public:
	struct FUIParticleRandomFactor                Factor;                                            // 0x0038(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_ScalarParam_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_ScalarParam_Runtime")
	}
	static class UEasyParticleComponent_ScalarParam_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_ScalarParam_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_ScalarParam_Runtime;

// Class EasyParticle.EasyParticleComponent_Size
// 0x01A8 (0x01F8 - 0x0050)
class UEasyParticleComponent_Size final : public UEasyParticleComponent
{
public:
	struct FEasyParticlePropertyFloat             Size;                                              // 0x0050(0x01A8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_Size")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_Size")
	}
	static class UEasyParticleComponent_Size* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_Size>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_Size;

// Class EasyParticle.EasyParticleComponent_Size_Runtime
// 0x0008 (0x0040 - 0x0038)
class UEasyParticleComponent_Size_Runtime final : public UEasyParticleComponentRuntime
{
public:
	struct FUIParticleRandomFactor                Factor;                                            // 0x0038(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_Size_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_Size_Runtime")
	}
	static class UEasyParticleComponent_Size_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_Size_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_Size_Runtime;

// Class EasyParticle.EasyParticleComponent_SizeScaleBySpeed
// 0x0350 (0x03A0 - 0x0050)
class UEasyParticleComponent_SizeScaleBySpeed final : public UEasyParticleComponent
{
public:
	struct FEasyParticlePropertyFloat             ScaleX;                                            // 0x0050(0x01A8)(Edit, NativeAccessSpecifierPublic)
	struct FEasyParticlePropertyFloat             ScaleY;                                            // 0x01F8(0x01A8)(Edit, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_SizeScaleBySpeed")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_SizeScaleBySpeed")
	}
	static class UEasyParticleComponent_SizeScaleBySpeed* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_SizeScaleBySpeed>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_SizeScaleBySpeed;

// Class EasyParticle.EasyParticleComponent_SizeScaleBySpeed_Runtime
// 0x0008 (0x0040 - 0x0038)
class UEasyParticleComponent_SizeScaleBySpeed_Runtime final : public UEasyParticleComponentRuntime
{
public:
	struct FUIParticleRandomFactor                FactorX;                                           // 0x0038(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FUIParticleRandomFactor                FactorY;                                           // 0x003C(0x0004)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EasyParticleComponent_SizeScaleBySpeed_Runtime")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EasyParticleComponent_SizeScaleBySpeed_Runtime")
	}
	static class UEasyParticleComponent_SizeScaleBySpeed_Runtime* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEasyParticleComponent_SizeScaleBySpeed_Runtime>();
	}
};
DUMPER7_ASSERTS_UEasyParticleComponent_SizeScaleBySpeed_Runtime;

// Class EasyParticle.EasyParticleComponent_SizeXY
// 0x0350 (0x03A0 - 0x0050)
class UEasyParticleComponent_SizeXY final : public UEasyParticleComponent
{
public:
	struct FEasyParticlePropertyFloat             SizeX;                                             // 0x0050(0x01A8)(Edit, NativeAccessSpecifierPublic)
