#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GallerySystemDataBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ProjectP_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass GallerySystemDataBP.GallerySystemDataBP_C
// 0x0038 (0x0258 - 0x0220)
class AGallerySystemDataBP_C final : public ALGallerySystemData
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 SpawnedModel;                                      // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SpawningCodeName;                                  // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReserveSpawnCodeName;                              // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ReserveSpawnLocation;                              // 0x0248(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GallerySystemDataBP(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Spawn(const class FName& CodeName, const struct FVector& InLocation, class ACineCameraActor* InPreviewCam, float InPreviewCam_OriginZ);
	void OnLoaded_2FC58C774C8706F0E0E7C8A777D6A323(TSubclassOf<class UObject> Loaded);
	class AActor* GetSpawned();
	void CalcCamZByPivot(class USceneComponent* InCam, class USceneComponent* InPivot, float* OutInterval);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GallerySystemDataBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GallerySystemDataBP_C")
	}
	static class AGallerySystemDataBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGallerySystemDataBP_C>();
	}
};
DUMPER7_ASSERTS_AGallerySystemDataBP_C;

SDK_NAMESPACE_END
