#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HoudiniNiagara

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// Enum HoudiniNiagara.EHoudiniPointCacheFileType
// NumValues: 0x0005
enum class EHoudiniPointCacheFileType : uint8
{
	Invalid                                  = 0,
	CSV                                      = 1,
	JSON                                     = 2,
	BJSON                                    = 3,
	EHoudiniPointCacheFileType_MAX           = 4,
};

// Enum HoudiniNiagara.EHoudiniAttributes
// NumValues: 0x000F
enum class EHoudiniAttributes : uint8
{
	HOUDINI_ATTR_BEGIN                       = 0,
	position                                 = 0,
	Normal                                   = 1,
	Time                                     = 2,
	POINTID                                  = 3,
	LIFE                                     = 4,
	Color                                    = 5,
	ALPHA                                    = 6,
	Velocity                                 = 7,
	Type                                     = 8,
	Impulse                                  = 9,
	AGE                                      = 10,
	HOUDINI_ATTR_SIZE                        = 11,
	HOUDINI_ATTR_END                         = 10,
	EHoudiniAttributes_MAX                   = 12,
};

// ScriptStruct HoudiniNiagara.PointIndexes
// 0x0010 (0x0010 - 0x0000)
struct FPointIndexes final
{
public:
	TArray<int32>                                 SampleIndexes;                                     // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPointIndexes;

// ScriptStruct HoudiniNiagara.HoudiniEvent
// 0x0048 (0x0048 - 0x0000)
struct FHoudiniEvent final
{
public:
	struct FVector                                position;                                          // 0x0000(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Normal;                                            // 0x000C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Impulse;                                           // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Velocity;                                          // 0x001C(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         POINTID;                                           // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LIFE;                                              // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0034(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHoudiniEvent;

SDK_NAMESPACE_END
