#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LGalleryActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass LGalleryActor.LGalleryActor_C
// 0x0020 (0x0240 - 0x0220)
class ALGalleryActor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         CameraMoveWidth;                                   // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraMoveHeight;                                  // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIBP_ActorController_C*                OwnerController;                                   // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LGalleryActor(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Get_Camera_Pivot_Component(bool ForPreviewCam, class USceneComponent** Component);
	void GetGalleryMeshComponent(class UMeshComponent** GalleryMesh);
	void SetCameraMoveMaxInfo(float MaxWidth, float MaxHeight);

	void Get_Zoom_in_Out_Limit_Value(float* OutMin, float* OutMax) const;
	void Get_Zoom_Speed(float* OutSpeed) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("LGalleryActor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LGalleryActor_C")
	}
	static class ALGalleryActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALGalleryActor_C>();
	}
};
DUMPER7_ASSERTS_ALGalleryActor_C;

SDK_NAMESPACE_END
