#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LGameInstanceBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "ProjectP_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass LGameInstanceBP.LGameInstanceBP_C
// 0x0028 (0x02C8 - 0x02A0)
class ULGameInstanceBP_C final : public ULGameInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          use_die_slow_for_trailer;                          // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          use_always_explosion;                              // 0x02A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          test_hit_intensity;                                // 0x02AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AB[0x1];                                      // 0x02AB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         test_hit_intensity_knockback;                      // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         test_hit_intensity_paral;                          // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELHitMotionType                               test_hit_intencity_motiontype;                     // 0x02B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSkillHitInfoPtr                       test_hit_intencity_skillhit;                       // 0x02B8(0x0008)(Edit, BlueprintVisible, NoDestructor)
	bool                                          Test_Fatal_SlaveArm;                               // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Test_UseSliceDead;                                 // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          test_hit_result;                                   // 0x02C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_LGameInstanceBP(int32 EntryPoint);
	void MakeNewCharacterBP(bool bInEditor);
	void AddWeapon(class FName HandleCodeName, class FName BladeCodeName, class ULItem** Item);
	void AddItem(class FName CodeName, class ULItem** Item);
	bool ExecBP(class UWorld* InWorld, const class FString& Cmd);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("LGameInstanceBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LGameInstanceBP_C")
	}
	static class ULGameInstanceBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULGameInstanceBP_C>();
	}
};
DUMPER7_ASSERTS_ULGameInstanceBP_C;

SDK_NAMESPACE_END
