#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LNPCControllerBP

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function LNPCControllerBP.LNPCControllerBP_C.ExecuteUbergraph_LNPCControllerBP
// 0x0018 (0x0018 - 0x0000)
struct LNPCControllerBP_C_ExecuteUbergraph_LNPCControllerBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBehaviorTree*                          K2Node_Event_CustomBehaviroTree;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_LNPCControllerBP_C_ExecuteUbergraph_LNPCControllerBP;

// Function LNPCControllerBP.LNPCControllerBP_C.RunInitBehaviorTree
// 0x0008 (0x0008 - 0x0000)
struct LNPCControllerBP_C_RunInitBehaviorTree final
{
public:
	class UBehaviorTree*                          CustomBehaviroTree;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LNPCControllerBP_C_RunInitBehaviorTree;

// Function LNPCControllerBP.LNPCControllerBP_C.OnMovementNavigationQueryFilter
// 0x0010 (0x0010 - 0x0000)
struct LNPCControllerBP_C_OnMovementNavigationQueryFilter final
{
public:
	TSubclassOf<class UNavigationQueryFilter>     FilterClass;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	ENPCGradeType                                 CallFunc_GetGrade_ReturnValue;                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_LNPCControllerBP_C_OnMovementNavigationQueryFilter;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
