#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LNPCCharacterBP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass LNPCCharacterBP.LNPCCharacterBP_C
// 0x0090 (0x13D0 - 0x1340)
#pragma pack(push, 0x1)
class SDK_ALIGN(0x10) ALNPCCharacterBP_C : public ALNPCCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_PhysicsImpactSound_C*               BP_PhysicsImpactSound;                             // 0x1348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        Sound_EyeBlink;                                    // 0x1350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULEquipmentComponentBP_C*               LEquipmentComponentBP;                             // 0x1358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNavigationInvokerComponent*            NavigationInvoker;                                 // 0x1360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_FluidImplementation_C*              BP_FluidImplementation;                            // 0x1368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        Asset_Class;                                       // 0x1370(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FLMaterialVaryingScalar>        Eye_Disable_Scalar_Values;                         // 0x1388(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FLMaterialVaryingColor>         Eye_Disable_Color_Values;                          // 0x1398(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   HeadTagTargetBone;                                 // 0x13A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HeadTagOffsetHeight;                               // 0x13B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HeadTagPosition;                                   // 0x13B4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EyeBoneName;                                       // 0x13C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LNPCCharacterBP(int32 EntryPoint);
	void OnExplostionDead(bool Cut);
	void ReceivePostBeginPlay();
	void DeadCharacterBP();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void SetCombatStateBP(bool bCombatState);
	void UserConstructionScript();
	void Dead_Physics(bool PhysicsOn, float DeltaSec, float InterpValue, float PhysicalValue, class FName BoneName);
	void LNPC_EyeFlash(class UMeshComponent* MeshComp, bool OFF, class FName ParamName, bool On_Random, float ParamValueON_Default, float ParamValueON_RandomMax, float ParamValueOFF);
	void GetNpcBGM(class FName* BGMCodeName);
	void UpdateHeadTagPosition();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("LNPCCharacterBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LNPCCharacterBP_C")
	}
	static class ALNPCCharacterBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALNPCCharacterBP_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ALNPCCharacterBP_C;

SDK_NAMESPACE_END
