#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LPCCharacterBP_StatRoom

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EN_StatRoomMotionType_structs.hpp"
#include "ProjectP_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass LPCCharacterBP_StatRoom.LPCCharacterBP_StatRoom_C
// 0x0060 (0x0CE0 - 0x0C80)
class ALPCCharacterBP_StatRoom_C final : public ALStatRoomPCCharacter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Mesh_Mask;                                         // 0x0C88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ULEquipmentComponentBP_C*               LEquipmentComponentBP;                             // 0x0C90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mesh_Hair;                                         // 0x0C98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mesh_Face;                                         // 0x0CA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Monad_Active_01_GDH;                            // 0x0CA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Monad_1_Grow_01_GDH;                            // 0x0CB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_PC_PROB_PCLamp_01;                              // 0x0CB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EN_StatRoomMotionType                         MotionType;                                        // 0x0CC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC1[0x7];                                      // 0x0CC1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CameraActor;                                       // 0x0CC8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_LPCCharacterBP_StatRoom(int32 EntryPoint);
	void OnActiveMesh(bool Active);
	void AttachPCLamp();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("LPCCharacterBP_StatRoom_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LPCCharacterBP_StatRoom_C")
	}
	static class ALPCCharacterBP_StatRoom_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALPCCharacterBP_StatRoom_C>();
	}
};
DUMPER7_ASSERTS_ALPCCharacterBP_StatRoom_C;

SDK_NAMESPACE_END
