#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MeshModelingTools

#include "Basic.hpp"

#include "InteractiveToolsFramework_classes.hpp"
#include "ModelingOperators_structs.hpp"
#include "MeshModelingTools_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ModelingComponents_classes.hpp"


SDK_NAMESPACE_START

// Class MeshModelingTools.HoleFillToolActions
// 0x0008 (0x0068 - 0x0060)
class UHoleFillToolActions final : public UInteractiveToolPropertySet
{
public:
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Clear();
	void SelectAll();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HoleFillToolActions")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HoleFillToolActions")
	}
	static class UHoleFillToolActions* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHoleFillToolActions>();
	}
};
DUMPER7_ASSERTS_UHoleFillToolActions;

// Class MeshModelingTools.ProceduralShapeToolProperties
// 0x0010 (0x0070 - 0x0060)
class UProceduralShapeToolProperties : public UInteractiveToolPropertySet
{
public:
	bool                                          bInstanceIfPossible;                               // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMakeMeshPolygroupMode                        PolygroupMode;                                     // 0x0061(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMakeMeshPlacementType                        PlaceMode;                                         // 0x0062(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSnapToGrid;                                       // 0x0063(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMakeMeshPivotLocation                        PivotLocation;                                     // 0x0064(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Rotation;                                          // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlignShapeToPlacementSurface;                     // 0x006C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProceduralShapeToolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProceduralShapeToolProperties")
	}
	static class UProceduralShapeToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralShapeToolProperties>();
	}
};
DUMPER7_ASSERTS_UProceduralShapeToolProperties;

// Class MeshModelingTools.ProceduralRectangleToolProperties
// 0x0010 (0x0080 - 0x0070)
class UProceduralRectangleToolProperties : public UProceduralShapeToolProperties
{
public:
	float                                         Width;                                             // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Depth;                                             // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WidthSubdivisions;                                 // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DepthSubdivisions;                                 // 0x007C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProceduralRectangleToolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProceduralRectangleToolProperties")
	}
	static class UProceduralRectangleToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralRectangleToolProperties>();
	}
};
DUMPER7_ASSERTS_UProceduralRectangleToolProperties;

// Class MeshModelingTools.ProceduralRoundedRectangleToolProperties
// 0x0008 (0x0088 - 0x0080)
class UProceduralRoundedRectangleToolProperties final : public UProceduralRectangleToolProperties
{
public:
	float                                         CornerRadius;                                      // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CornerSlices;                                      // 0x0084(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProceduralRoundedRectangleToolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProceduralRoundedRectangleToolProperties")
	}
	static class UProceduralRoundedRectangleToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralRoundedRectangleToolProperties>();
	}
};
DUMPER7_ASSERTS_UProceduralRoundedRectangleToolProperties;

// Class MeshModelingTools.MeshSculptToolBase
// 0x0920 (0x09E0 - 0x00C0)
#pragma pack(push, 0x1)
class alignas(0x10) UMeshSculptToolBase : public UMeshSurfacePointTool
{
public:
	class USculptBrushProperties*                 BrushProperties;                                   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWorkPlaneProperties*                   GizmoProperties;                                   // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D0[0xE0];                                      // 0x00D0(0x00E0)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, class UMeshSculptBrushOpProps*>   BrushOpPropSets;                                   // 0x01B0(0x0050)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_200[0x50];                                     // 0x0200(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, class UMeshSculptBrushOpProps*>   SecondaryBrushOpPropSets;                          // 0x0250(0x0050)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A0[0x5D0];                                    // 0x02A0(0x05D0)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshEditingViewProperties*             ViewProperties;                                    // 0x0870(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               ActiveOverrideMaterial;                            // 0x0878(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBrushStampIndicator*                   BrushIndicator;                                    // 0x0880(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               BrushIndicatorMaterial;                            // 0x0888(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPreviewMesh*                           BrushIndicatorMesh;                                // 0x0890(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTransformGizmo*                        PlaneTransformGizmo;                               // 0x0898(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTransformProxy*                        PlaneTransformProxy;                               // 0x08A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8A8[0x130];                                    // 0x08A8(0x0130)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshSculptToolBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshSculptToolBase")
	}
	static class UMeshSculptToolBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshSculptToolBase>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UMeshSculptToolBase;

// Class MeshModelingTools.MeshVertexSculptTool
// 0x0850 (0x1230 - 0x09E0)
class UMeshVertexSculptTool final : public UMeshSculptToolBase
{
public:
	class UVertexBrushSculptProperties*           SculptProperties;                                  // 0x09D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USimpleDynamicMeshComponent*            DynamicMeshComponent;                              // 0x09E0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9E8[0x848];                                    // 0x09E8(0x0848)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshVertexSculptTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshVertexSculptTool")
	}
	static class UMeshVertexSculptTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshVertexSculptTool>();
	}
};
DUMPER7_ASSERTS_UMeshVertexSculptTool;

// Class MeshModelingTools.DisplaceMeshSineWaveProperties
// 0x0018 (0x0078 - 0x0060)
class UDisplaceMeshSineWaveProperties final : public UInteractiveToolPropertySet
{
public:
	float                                         SineWaveFrequency;                                 // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SineWavePhaseShift;                                // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                SineWaveDirection;                                 // 0x0068(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DisplaceMeshSineWaveProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DisplaceMeshSineWaveProperties")
	}
	static class UDisplaceMeshSineWaveProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDisplaceMeshSineWaveProperties>();
	}
};
DUMPER7_ASSERTS_UDisplaceMeshSineWaveProperties;

// Class MeshModelingTools.ExtractCollisionGeometryTool
// 0x02A8 (0x0330 - 0x0088)
class UExtractCollisionGeometryTool final : public USingleSelectionTool
{
public:
	class UCollisionGeometryVisualizationProperties* VizSettings;                                    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPhysicsObjectToolPropertySet*          ObjectProps;                                       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPreviewGeometry*                       PreviewElements;                                   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPreviewMesh*                           PreviewMesh;                                       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A8[0x288];                                     // 0x00A8(0x0288)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ExtractCollisionGeometryTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ExtractCollisionGeometryTool")
	}
	static class UExtractCollisionGeometryTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UExtractCollisionGeometryTool>();
	}
};
DUMPER7_ASSERTS_UExtractCollisionGeometryTool;

// Class MeshModelingTools.AddPatchToolBuilder
// 0x0008 (0x0030 - 0x0028)
class UAddPatchToolBuilder final : public UInteractiveToolBuilder
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AddPatchToolBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AddPatchToolBuilder")
	}
	static class UAddPatchToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddPatchToolBuilder>();
	}
};
DUMPER7_ASSERTS_UAddPatchToolBuilder;

// Class MeshModelingTools.DisplaceMeshToolBuilder
// 0x0000 (0x0028 - 0x0028)
class UDisplaceMeshToolBuilder final : public UInteractiveToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DisplaceMeshToolBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DisplaceMeshToolBuilder")
	}
	static class UDisplaceMeshToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDisplaceMeshToolBuilder>();
	}
};
DUMPER7_ASSERTS_UDisplaceMeshToolBuilder;

// Class MeshModelingTools.AddPatchToolProperties
// 0x0010 (0x0070 - 0x0060)
class UAddPatchToolProperties final : public UInteractiveToolPropertySet
{
public:
	float                                         Width;                                             // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Rotation;                                          // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Subdivisions;                                      // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Shift;                                             // 0x006C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AddPatchToolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AddPatchToolProperties")
	}
	static class UAddPatchToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddPatchToolProperties>();
	}
};
DUMPER7_ASSERTS_UAddPatchToolProperties;

// Class MeshModelingTools.AddPatchTool
// 0x0078 (0x0100 - 0x0088)
class UAddPatchTool final : public USingleClickTool
{
public:
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAddPatchToolProperties*                ShapeSettings;                                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNewMeshMaterialProperties*             MaterialProperties;                                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPreviewMesh*                           PreviewMesh;                                       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A8[0x58];                                      // 0x00A8(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AddPatchTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AddPatchTool")
	}
	static class UAddPatchTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddPatchTool>();
	}
};
DUMPER7_ASSERTS_UAddPatchTool;

// Class MeshModelingTools.GroupEdgeInsertionTool
// 0x04C8 (0x0550 - 0x0088)
class alignas(0x10) UGroupEdgeInsertionTool final : public USingleSelectionTool
{
public:
	uint8                                         Pad_88[0x10];                                      // 0x0088(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class UGroupEdgeInsertionProperties*          Settings;                                          // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMeshOpPreviewWithBackgroundCompute*    Preview;                                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_A8[0x4A8];                                     // 0x00A8(0x04A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroupEdgeInsertionTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroupEdgeInsertionTool")
	}
	static class UGroupEdgeInsertionTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroupEdgeInsertionTool>();
	}
};
DUMPER7_ASSERTS_UGroupEdgeInsertionTool;

// Class MeshModelingTools.AddPrimitiveToolBuilder
// 0x0010 (0x0038 - 0x0028)
class UAddPrimitiveToolBuilder final : public UInteractiveToolBuilder
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AddPrimitiveToolBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AddPrimitiveToolBuilder")
	}
	static class UAddPrimitiveToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddPrimitiveToolBuilder>();
	}
};
DUMPER7_ASSERTS_UAddPrimitiveToolBuilder;

// Class MeshModelingTools.MeshSculptBrushOpProps
// 0x0000 (0x0060 - 0x0060)
class UMeshSculptBrushOpProps : public UInteractiveToolPropertySet
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshSculptBrushOpProps")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshSculptBrushOpProps")
	}
	static class UMeshSculptBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshSculptBrushOpProps>();
	}
};
DUMPER7_ASSERTS_UMeshSculptBrushOpProps;

// Class MeshModelingTools.BaseKelvinletBrushOpProps
// 0x0010 (0x0070 - 0x0060)
class UBaseKelvinletBrushOpProps : public UMeshSculptBrushOpProps
{
public:
	float                                         Stiffness;                                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Incompressiblity;                                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BrushSteps;                                        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseKelvinletBrushOpProps")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseKelvinletBrushOpProps")
	}
	static class UBaseKelvinletBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseKelvinletBrushOpProps>();
	}
};
DUMPER7_ASSERTS_UBaseKelvinletBrushOpProps;

// Class MeshModelingTools.ScaleKelvinletBrushOpProps
// 0x0008 (0x0078 - 0x0070)
class UScaleKelvinletBrushOpProps final : public UBaseKelvinletBrushOpProps
{
public:
	float                                         Strength;                                          // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Falloff;                                           // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScaleKelvinletBrushOpProps")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScaleKelvinletBrushOpProps")
	}
	static class UScaleKelvinletBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScaleKelvinletBrushOpProps>();
	}
};
DUMPER7_ASSERTS_UScaleKelvinletBrushOpProps;

// Class MeshModelingTools.ProceduralBoxToolProperties
// 0x0008 (0x0088 - 0x0080)
class UProceduralBoxToolProperties final : public UProceduralRectangleToolProperties
{
public:
	float                                         Height;                                            // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HeightSubdivisions;                                // 0x0084(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProceduralBoxToolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProceduralBoxToolProperties")
	}
	static class UProceduralBoxToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralBoxToolProperties>();
	}
};
DUMPER7_ASSERTS_UProceduralBoxToolProperties;

// Class MeshModelingTools.ProceduralDiscToolProperties
// 0x0010 (0x0080 - 0x0070)
class UProceduralDiscToolProperties : public UProceduralShapeToolProperties
{
public:
	float                                         Radius;                                            // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RadialSlices;                                      // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RadialSubdivisions;                                // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProceduralDiscToolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProceduralDiscToolProperties")
	}
	static class UProceduralDiscToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralDiscToolProperties>();
	}
};
DUMPER7_ASSERTS_UProceduralDiscToolProperties;

// Class MeshModelingTools.GroupEdgeInsertionProperties
// 0x0010 (0x0070 - 0x0060)
class UGroupEdgeInsertionProperties final : public UInteractiveToolPropertySet
{
public:
	EGroupEdgeInsertionMode                       InsertionMode;                                     // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWireframe;                                        // 0x0064(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        VertexTolerance;                                   // 0x0068(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GroupEdgeInsertionProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GroupEdgeInsertionProperties")
	}
	static class UGroupEdgeInsertionProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGroupEdgeInsertionProperties>();
	}
};
DUMPER7_ASSERTS_UGroupEdgeInsertionProperties;

// Class MeshModelingTools.ProceduralPuncturedDiscToolProperties
// 0x0008 (0x0088 - 0x0080)
class UProceduralPuncturedDiscToolProperties final : public UProceduralDiscToolProperties
{
public:
	float                                         HoleRadius;                                        // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProceduralPuncturedDiscToolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProceduralPuncturedDiscToolProperties")
	}
	static class UProceduralPuncturedDiscToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralPuncturedDiscToolProperties>();
	}
};
DUMPER7_ASSERTS_UProceduralPuncturedDiscToolProperties;

// Class MeshModelingTools.ProceduralTorusToolProperties
// 0x0010 (0x0080 - 0x0070)
class UProceduralTorusToolProperties final : public UProceduralShapeToolProperties
{
public:
	float                                         MajorRadius;                                       // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinorRadius;                                       // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TubeSlices;                                        // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CrossSectionSlices;                                // 0x007C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProceduralTorusToolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProceduralTorusToolProperties")
	}
	static class UProceduralTorusToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralTorusToolProperties>();
	}
};
DUMPER7_ASSERTS_UProceduralTorusToolProperties;

// Class MeshModelingTools.ProceduralCylinderToolProperties
// 0x0010 (0x0080 - 0x0070)
class UProceduralCylinderToolProperties final : public UProceduralShapeToolProperties
{
public:
	float                                         Radius;                                            // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RadialSlices;                                      // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HeightSubdivisions;                                // 0x007C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProceduralCylinderToolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProceduralCylinderToolProperties")
	}
	static class UProceduralCylinderToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralCylinderToolProperties>();
	}
};
DUMPER7_ASSERTS_UProceduralCylinderToolProperties;

// Class MeshModelingTools.ProceduralConeToolProperties
// 0x0010 (0x0080 - 0x0070)
class UProceduralConeToolProperties final : public UProceduralShapeToolProperties
{
public:
	float                                         Radius;                                            // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RadialSlices;                                      // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HeightSubdivisions;                                // 0x007C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProceduralConeToolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProceduralConeToolProperties")
	}
	static class UProceduralConeToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralConeToolProperties>();
	}
};
DUMPER7_ASSERTS_UProceduralConeToolProperties;

// Class MeshModelingTools.DynamicMeshBrushTool
// 0x0040 (0x01F8 - 0x01B8)
class UDynamicMeshBrushTool : public UBaseBrushTool
{
public:
	class UPreviewMesh*                           PreviewMesh;                                       // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C0[0x38];                                     // 0x01C0(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicMeshBrushTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicMeshBrushTool")
	}
	static class UDynamicMeshBrushTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicMeshBrushTool>();
	}
};
DUMPER7_ASSERTS_UDynamicMeshBrushTool;

// Class MeshModelingTools.MeshAttributePaintTool
// 0x0418 (0x0610 - 0x01F8)
class alignas(0x10) UMeshAttributePaintTool final : public UDynamicMeshBrushTool
{
public:
	class UMeshAttributePaintToolProperties*      AttribProps;                                       // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_200[0x410];                                    // 0x0200(0x0410)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshAttributePaintTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshAttributePaintTool")
	}
	static class UMeshAttributePaintTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshAttributePaintTool>();
	}
};
DUMPER7_ASSERTS_UMeshAttributePaintTool;

// Class MeshModelingTools.ProceduralArrowToolProperties
// 0x0018 (0x0088 - 0x0070)
class UProceduralArrowToolProperties final : public UProceduralShapeToolProperties
{
public:
	float                                         ShaftRadius;                                       // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ShaftHeight;                                       // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeadRadius;                                        // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeadHeight;                                        // 0x007C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RadialSlices;                                      // 0x0080(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalSubdivisions;                                 // 0x0084(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProceduralArrowToolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProceduralArrowToolProperties")
	}
	static class UProceduralArrowToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralArrowToolProperties>();
	}
};
DUMPER7_ASSERTS_UProceduralArrowToolProperties;

// Class MeshModelingTools.ProceduralSphereToolProperties
// 0x0010 (0x0080 - 0x0070)
class UProceduralSphereToolProperties final : public UProceduralShapeToolProperties
{
public:
	float                                         Radius;                                            // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LatitudeSlices;                                    // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LongitudeSlices;                                   // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProceduralSphereToolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProceduralSphereToolProperties")
	}
	static class UProceduralSphereToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralSphereToolProperties>();
	}
};
DUMPER7_ASSERTS_UProceduralSphereToolProperties;

// Class MeshModelingTools.ProceduralSphericalBoxToolProperties
// 0x0008 (0x0078 - 0x0070)
class UProceduralSphericalBoxToolProperties final : public UProceduralShapeToolProperties
{
public:
	float                                         Radius;                                            // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Subdivisions;                                      // 0x0074(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProceduralSphericalBoxToolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProceduralSphericalBoxToolProperties")
	}
	static class UProceduralSphericalBoxToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProceduralSphericalBoxToolProperties>();
	}
};
DUMPER7_ASSERTS_UProceduralSphericalBoxToolProperties;

// Class MeshModelingTools.LastActorInfo
// 0x0030 (0x0058 - 0x0028)
class ULastActorInfo final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Actor;                                             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            StaticMesh;                                        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UProceduralShapeToolProperties*         ShapeSettings;                                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNewMeshMaterialProperties*             MaterialProperties;                                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LastActorInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LastActorInfo")
	}
	static class ULastActorInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULastActorInfo>();
	}
};
DUMPER7_ASSERTS_ULastActorInfo;

// Class MeshModelingTools.AddPrimitiveTool
// 0x0068 (0x00F0 - 0x0088)
class UAddPrimitiveTool : public USingleClickTool
{
public:
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UProceduralShapeToolProperties*         ShapeSettings;                                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNewMeshMaterialProperties*             MaterialProperties;                                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPreviewMesh*                           PreviewMesh;                                       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULastActorInfo*                         LastGenerated;                                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 AssetName;                                         // 0x00B0(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_C0[0x30];                                      // 0x00C0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AddPrimitiveTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AddPrimitiveTool")
	}
	static class UAddPrimitiveTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddPrimitiveTool>();
	}
};
DUMPER7_ASSERTS_UAddPrimitiveTool;

// Class MeshModelingTools.AddBoxPrimitiveTool
// 0x0000 (0x00F0 - 0x00F0)
class UAddBoxPrimitiveTool final : public UAddPrimitiveTool
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AddBoxPrimitiveTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AddBoxPrimitiveTool")
	}
	static class UAddBoxPrimitiveTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddBoxPrimitiveTool>();
	}
};
DUMPER7_ASSERTS_UAddBoxPrimitiveTool;

// Class MeshModelingTools.MeshAttributePaintToolProperties
// 0x0028 (0x0088 - 0x0060)
class UMeshAttributePaintToolProperties final : public UInteractiveToolPropertySet
{
public:
	TArray<class FName>                           Attributes;                                        // 0x0060(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	int32                                         SelectedAttribute;                                 // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AttributeName;                                     // 0x0078(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshAttributePaintToolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshAttributePaintToolProperties")
	}
	static class UMeshAttributePaintToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshAttributePaintToolProperties>();
	}
};
DUMPER7_ASSERTS_UMeshAttributePaintToolProperties;

// Class MeshModelingTools.AddCylinderPrimitiveTool
// 0x0000 (0x00F0 - 0x00F0)
class UAddCylinderPrimitiveTool final : public UAddPrimitiveTool
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AddCylinderPrimitiveTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AddCylinderPrimitiveTool")
	}
	static class UAddCylinderPrimitiveTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddCylinderPrimitiveTool>();
	}
};
DUMPER7_ASSERTS_UAddCylinderPrimitiveTool;

// Class MeshModelingTools.AddConePrimitiveTool
// 0x0000 (0x00F0 - 0x00F0)
class UAddConePrimitiveTool final : public UAddPrimitiveTool
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AddConePrimitiveTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AddConePrimitiveTool")
	}
	static class UAddConePrimitiveTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddConePrimitiveTool>();
	}
};
DUMPER7_ASSERTS_UAddConePrimitiveTool;

// Class MeshModelingTools.MeshEditingViewProperties
// 0x0028 (0x0088 - 0x0060)
class UMeshEditingViewProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bShowWireframe;                                    // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EMeshEditingMaterialModes                     MaterialMode;                                      // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlatShading;                                      // 0x0068(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Color;                                             // 0x006C(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Image;                                             // 0x0080(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshEditingViewProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshEditingViewProperties")
	}
	static class UMeshEditingViewProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshEditingViewProperties>();
	}
};
DUMPER7_ASSERTS_UMeshEditingViewProperties;

// Class MeshModelingTools.AddRectanglePrimitiveTool
// 0x0000 (0x00F0 - 0x00F0)
class UAddRectanglePrimitiveTool final : public UAddPrimitiveTool
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AddRectanglePrimitiveTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AddRectanglePrimitiveTool")
	}
	static class UAddRectanglePrimitiveTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddRectanglePrimitiveTool>();
	}
};
DUMPER7_ASSERTS_UAddRectanglePrimitiveTool;

// Class MeshModelingTools.AddRoundedRectanglePrimitiveTool
// 0x0000 (0x00F0 - 0x00F0)
class UAddRoundedRectanglePrimitiveTool final : public UAddPrimitiveTool
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AddRoundedRectanglePrimitiveTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AddRoundedRectanglePrimitiveTool")
	}
	static class UAddRoundedRectanglePrimitiveTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddRoundedRectanglePrimitiveTool>();
	}
};
DUMPER7_ASSERTS_UAddRoundedRectanglePrimitiveTool;

// Class MeshModelingTools.InflateBrushOpProps
// 0x0008 (0x0068 - 0x0060)
class UInflateBrushOpProps final : public UMeshSculptBrushOpProps
{
public:
	float                                         Strength;                                          // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Falloff;                                           // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("InflateBrushOpProps")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"InflateBrushOpProps")
	}
	static class UInflateBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInflateBrushOpProps>();
	}
};
DUMPER7_ASSERTS_UInflateBrushOpProps;

// Class MeshModelingTools.AddDiscPrimitiveTool
// 0x0000 (0x00F0 - 0x00F0)
class UAddDiscPrimitiveTool final : public UAddPrimitiveTool
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AddDiscPrimitiveTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AddDiscPrimitiveTool")
	}
	static class UAddDiscPrimitiveTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddDiscPrimitiveTool>();
	}
};
DUMPER7_ASSERTS_UAddDiscPrimitiveTool;

// Class MeshModelingTools.AddPuncturedDiscPrimitiveTool
// 0x0000 (0x00F0 - 0x00F0)
class UAddPuncturedDiscPrimitiveTool final : public UAddPrimitiveTool
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AddPuncturedDiscPrimitiveTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AddPuncturedDiscPrimitiveTool")
	}
	static class UAddPuncturedDiscPrimitiveTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddPuncturedDiscPrimitiveTool>();
	}
};
DUMPER7_ASSERTS_UAddPuncturedDiscPrimitiveTool;

// Class MeshModelingTools.MeshAnalysisProperties
// 0x0020 (0x0080 - 0x0060)
class UMeshAnalysisProperties final : public UInteractiveToolPropertySet
{
public:
	class FString                                 SurfaceArea;                                       // 0x0060(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Volume;                                            // 0x0070(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshAnalysisProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshAnalysisProperties")
	}
	static class UMeshAnalysisProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshAnalysisProperties>();
	}
};
DUMPER7_ASSERTS_UMeshAnalysisProperties;

// Class MeshModelingTools.AddTorusPrimitiveTool
// 0x0000 (0x00F0 - 0x00F0)
class UAddTorusPrimitiveTool final : public UAddPrimitiveTool
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AddTorusPrimitiveTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AddTorusPrimitiveTool")
	}
	static class UAddTorusPrimitiveTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddTorusPrimitiveTool>();
	}
};
DUMPER7_ASSERTS_UAddTorusPrimitiveTool;

// Class MeshModelingTools.AddArrowPrimitiveTool
// 0x0000 (0x00F0 - 0x00F0)
class UAddArrowPrimitiveTool final : public UAddPrimitiveTool
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AddArrowPrimitiveTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AddArrowPrimitiveTool")
	}
	static class UAddArrowPrimitiveTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddArrowPrimitiveTool>();
	}
};
DUMPER7_ASSERTS_UAddArrowPrimitiveTool;

// Class MeshModelingTools.NewMeshMaterialProperties
// 0x0010 (0x0070 - 0x0060)
class UNewMeshMaterialProperties final : public UInteractiveToolPropertySet
{
public:
	TWeakObjectPtr<class UMaterialInterface>      Material;                                          // 0x0060(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UVScale;                                           // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWorldSpaceUVScale;                                // 0x006C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWireframe;                                        // 0x006D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowExtendedOptions;                              // 0x006E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NewMeshMaterialProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NewMeshMaterialProperties")
	}
	static class UNewMeshMaterialProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNewMeshMaterialProperties>();
	}
};
DUMPER7_ASSERTS_UNewMeshMaterialProperties;

// Class MeshModelingTools.AddSpherePrimitiveTool
// 0x0000 (0x00F0 - 0x00F0)
class UAddSpherePrimitiveTool final : public UAddPrimitiveTool
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AddSpherePrimitiveTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AddSpherePrimitiveTool")
	}
	static class UAddSpherePrimitiveTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddSpherePrimitiveTool>();
	}
};
DUMPER7_ASSERTS_UAddSpherePrimitiveTool;

// Class MeshModelingTools.AddSphericalBoxPrimitiveTool
// 0x0000 (0x00F0 - 0x00F0)
class UAddSphericalBoxPrimitiveTool final : public UAddPrimitiveTool
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AddSphericalBoxPrimitiveTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AddSphericalBoxPrimitiveTool")
	}
	static class UAddSphericalBoxPrimitiveTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAddSphericalBoxPrimitiveTool>();
	}
};
DUMPER7_ASSERTS_UAddSphericalBoxPrimitiveTool;

// Class MeshModelingTools.ViewAlignedSculptBrushOpProps
// 0x0008 (0x0068 - 0x0060)
class UViewAlignedSculptBrushOpProps final : public UMeshSculptBrushOpProps
{
public:
	float                                         Strength;                                          // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Falloff;                                           // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ViewAlignedSculptBrushOpProps")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ViewAlignedSculptBrushOpProps")
	}
	static class UViewAlignedSculptBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UViewAlignedSculptBrushOpProps>();
	}
};
DUMPER7_ASSERTS_UViewAlignedSculptBrushOpProps;

// Class MeshModelingTools.AlignObjectsToolBuilder
// 0x0000 (0x0028 - 0x0028)
class UAlignObjectsToolBuilder final : public UInteractiveToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AlignObjectsToolBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AlignObjectsToolBuilder")
	}
	static class UAlignObjectsToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAlignObjectsToolBuilder>();
	}
};
DUMPER7_ASSERTS_UAlignObjectsToolBuilder;

// Class MeshModelingTools.AlignObjectsToolProperties
// 0x0010 (0x0070 - 0x0060)
class UAlignObjectsToolProperties final : public UInteractiveToolPropertySet
{
public:
	EAlignObjectsAlignTypes                       AlignType;                                         // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAlignObjectsAlignToOptions                   AlignTo;                                           // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAlignObjectsBoxPoint                         BoxPosition;                                       // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlignX;                                           // 0x006C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlignY;                                           // 0x006D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAlignZ;                                           // 0x006E(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6F[0x1];                                       // 0x006F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AlignObjectsToolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AlignObjectsToolProperties")
	}
	static class UAlignObjectsToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAlignObjectsToolProperties>();
	}
};
DUMPER7_ASSERTS_UAlignObjectsToolProperties;

// Class MeshModelingTools.PinchBrushOpProps
// 0x0010 (0x0070 - 0x0060)
class UPinchBrushOpProps final : public UMeshSculptBrushOpProps
{
public:
	float                                         Strength;                                          // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Falloff;                                           // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Depth;                                             // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPerpDamping;                                      // 0x006C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PinchBrushOpProps")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PinchBrushOpProps")
	}
	static class UPinchBrushOpProps* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPinchBrushOpProps>();
	}
};
DUMPER7_ASSERTS_UPinchBrushOpProps;

// Class MeshModelingTools.AlignObjectsTool
// 0x00B0 (0x0140 - 0x0090)
class UAlignObjectsTool final : public UMultiSelectionTool
{
public:
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAlignObjectsToolProperties*            AlignProps;                                        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A0[0xA0];                                      // 0x00A0(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AlignObjectsTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AlignObjectsTool")
	}
	static class UAlignObjectsTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAlignObjectsTool>();
	}
};
DUMPER7_ASSERTS_UAlignObjectsTool;

// Class MeshModelingTools.BakeMeshAttributeMapsToolBuilder
// 0x0008 (0x0030 - 0x0028)
class UBakeMeshAttributeMapsToolBuilder final : public UInteractiveToolBuilder
{
public:
