#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModelingComponents

#include "Basic.hpp"

#include "InteractiveToolsFramework_classes.hpp"
#include "ModelingComponents_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// Class ModelingComponents.BaseDynamicMeshComponent
// 0x0040 (0x04C0 - 0x0480)
class UBaseDynamicMeshComponent : public UMeshComponent
{
public:
	uint8                                         Pad_478[0x48];                                     // 0x0478(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseDynamicMeshComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseDynamicMeshComponent")
	}
	static class UBaseDynamicMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseDynamicMeshComponent>();
	}
};
DUMPER7_ASSERTS_UBaseDynamicMeshComponent;

// Class ModelingComponents.BaseCreateFromSelectedToolBuilder
// 0x0008 (0x0030 - 0x0028)
class UBaseCreateFromSelectedToolBuilder : public UInteractiveToolBuilder
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseCreateFromSelectedToolBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseCreateFromSelectedToolBuilder")
	}
	static class UBaseCreateFromSelectedToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseCreateFromSelectedToolBuilder>();
	}
};
DUMPER7_ASSERTS_UBaseCreateFromSelectedToolBuilder;

// Class ModelingComponents.OnAcceptHandleSourcesProperties
// 0x0008 (0x0068 - 0x0060)
class UOnAcceptHandleSourcesProperties : public UInteractiveToolPropertySet
{
public:
	EHandleSourcesMethod                          OnToolAccept;                                      // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnAcceptHandleSourcesProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnAcceptHandleSourcesProperties")
	}
	static class UOnAcceptHandleSourcesProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnAcceptHandleSourcesProperties>();
	}
};
DUMPER7_ASSERTS_UOnAcceptHandleSourcesProperties;

// Class ModelingComponents.BaseMeshProcessingTool
// 0x0378 (0x0400 - 0x0088)
class alignas(0x10) UBaseMeshProcessingTool : public USingleSelectionTool
{
public:
	uint8                                         Pad_88[0x28];                                      // 0x0088(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshOpPreviewWithBackgroundCompute*    Preview;                                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B8[0x348];                                     // 0x00B8(0x0348)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseMeshProcessingTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseMeshProcessingTool")
	}
	static class UBaseMeshProcessingTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseMeshProcessingTool>();
	}
};
DUMPER7_ASSERTS_UBaseMeshProcessingTool;

// Class ModelingComponents.BaseCreateFromSelectedHandleSourceProperties
// 0x0028 (0x0090 - 0x0068)
class UBaseCreateFromSelectedHandleSourceProperties final : public UOnAcceptHandleSourcesProperties
{
public:
	EBaseCreateFromSelectedTargetType             WriteOutputTo;                                     // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OutputName;                                        // 0x0070(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutputAsset;                                       // 0x0080(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseCreateFromSelectedHandleSourceProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseCreateFromSelectedHandleSourceProperties")
	}
	static class UBaseCreateFromSelectedHandleSourceProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseCreateFromSelectedHandleSourceProperties>();
	}
};
DUMPER7_ASSERTS_UBaseCreateFromSelectedHandleSourceProperties;

// Class ModelingComponents.TransformInputsToolProperties
// 0x0008 (0x0068 - 0x0060)
class UTransformInputsToolProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bShowTransformUI;                                  // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSnapToWorldGrid;                                  // 0x0061(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TransformInputsToolProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TransformInputsToolProperties")
	}
	static class UTransformInputsToolProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTransformInputsToolProperties>();
	}
};
DUMPER7_ASSERTS_UTransformInputsToolProperties;

// Class ModelingComponents.BaseCreateFromSelectedTool
// 0x0060 (0x00F0 - 0x0090)
class UBaseCreateFromSelectedTool : public UMultiSelectionTool
{
public:
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UTransformInputsToolProperties*         TransformProperties;                               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBaseCreateFromSelectedHandleSourceProperties* HandleSourcesProperties;                    // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMeshOpPreviewWithBackgroundCompute*    Preview;                                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UTransformProxy*>                TransformProxies;                                  // 0x00B0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UTransformGizmo*>                TransformGizmos;                                   // 0x00C0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FVector>                        TransformInitialScales;                            // 0x00D0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_E0[0x10];                                      // 0x00E0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseCreateFromSelectedTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseCreateFromSelectedTool")
	}
	static class UBaseCreateFromSelectedTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseCreateFromSelectedTool>();
	}
};
DUMPER7_ASSERTS_UBaseCreateFromSelectedTool;

// Class ModelingComponents.BaseMeshProcessingToolBuilder
// 0x0000 (0x0028 - 0x0028)
class UBaseMeshProcessingToolBuilder : public UInteractiveToolBuilder
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseMeshProcessingToolBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseMeshProcessingToolBuilder")
	}
	static class UBaseMeshProcessingToolBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseMeshProcessingToolBuilder>();
	}
};
DUMPER7_ASSERTS_UBaseMeshProcessingToolBuilder;

// Class ModelingComponents.BaseVoxelTool
// 0x0018 (0x0108 - 0x00F0)
class UBaseVoxelTool : public UBaseCreateFromSelectedTool
{
public:
	class UVoxelProperties*                       VoxProperties;                                     // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F8[0x10];                                      // 0x00F8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseVoxelTool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseVoxelTool")
	}
	static class UBaseVoxelTool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseVoxelTool>();
	}
};
DUMPER7_ASSERTS_UBaseVoxelTool;

// Class ModelingComponents.CollectSurfacePathMechanic
// 0x0520 (0x0550 - 0x0030)
class UCollectSurfacePathMechanic final : public UInteractionMechanic
{
public:
	uint8                                         Pad_30[0x520];                                     // 0x0030(0x0520)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CollectSurfacePathMechanic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CollectSurfacePathMechanic")
	}
	static class UCollectSurfacePathMechanic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCollectSurfacePathMechanic>();
	}
};
DUMPER7_ASSERTS_UCollectSurfacePathMechanic;

// Class ModelingComponents.ConstructionPlaneMechanic
// 0x00C0 (0x00F0 - 0x0030)
class alignas(0x10) UConstructionPlaneMechanic final : public UInteractionMechanic
{
public:
	uint8                                         Pad_30[0x98];                                      // 0x0030(0x0098)(Fixing Size After Last Property [ Dumper-7 ])
	class UTransformGizmo*                        PlaneTransformGizmo;                               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTransformProxy*                        PlaneTransformProxy;                               // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D8[0x10];                                      // 0x00D8(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class USingleClickInputBehavior*              ClickToSetPlaneBehavior;                           // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ConstructionPlaneMechanic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ConstructionPlaneMechanic")
	}
	static class UConstructionPlaneMechanic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UConstructionPlaneMechanic>();
	}
};
DUMPER7_ASSERTS_UConstructionPlaneMechanic;

// Class ModelingComponents.CurveControlPointsMechanic
// 0x0620 (0x0650 - 0x0030)
class alignas(0x10) UCurveControlPointsMechanic final : public UInteractionMechanic
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class USingleClickInputBehavior*              ClickBehavior;                                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMouseHoverBehavior*                    HoverBehavior;                                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x498];                                     // 0x0050(0x0498)(Fixing Size After Last Property [ Dumper-7 ])
	class APreviewGeometryActor*                  PreviewGeometryActor;                              // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPointSetComponent*                     DrawnControlPoints;                                // 0x04F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULineSetComponent*                      DrawnControlSegments;                              // 0x04F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPointSetComponent*                     PreviewPoint;                                      // 0x0500(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULineSetComponent*                      PreviewSegment;                                    // 0x0508(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_510[0x78];                                     // 0x0510(0x0078)(Fixing Size After Last Property [ Dumper-7 ])
	class UTransformProxy*                        PointTransformProxy;                               // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTransformGizmo*                        PointTransformGizmo;                               // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_598[0xB8];                                     // 0x0598(0x00B8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CurveControlPointsMechanic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CurveControlPointsMechanic")
	}
	static class UCurveControlPointsMechanic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCurveControlPointsMechanic>();
	}
};
DUMPER7_ASSERTS_UCurveControlPointsMechanic;

// Class ModelingComponents.DynamicMeshReplacementChangeTarget
// 0x0030 (0x0058 - 0x0028)
class UDynamicMeshReplacementChangeTarget final : public UObject
{
public:
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicMeshReplacementChangeTarget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicMeshReplacementChangeTarget")
	}
	static class UDynamicMeshReplacementChangeTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDynamicMeshReplacementChangeTarget>();
	}
};
DUMPER7_ASSERTS_UDynamicMeshReplacementChangeTarget;

// Class ModelingComponents.LineSetComponent
// 0x0060 (0x04E0 - 0x0480)
class ULineSetComponent final : public UMeshComponent
{
public:
	class UMaterialInterface*                     LineMaterial;                                      // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FBoxSphereBounds                       Bounds;                                            // 0x0480(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          bBoundsDirty;                                      // 0x049C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_49D[0x43];                                     // 0x049D(0x0043)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LineSetComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LineSetComponent")
	}
	static class ULineSetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULineSetComponent>();
	}
};
DUMPER7_ASSERTS_ULineSetComponent;

// Class ModelingComponents.MeshCommandChangeTarget
// 0x0000 (0x0000 - 0x0000)
class IMeshCommandChangeTarget final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshCommandChangeTarget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshCommandChangeTarget")
	}
	static class IMeshCommandChangeTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMeshCommandChangeTarget>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMeshCommandChangeTarget;

// Class ModelingComponents.MeshOpPreviewWithBackgroundCompute
// 0x0068 (0x0090 - 0x0028)
class UMeshOpPreviewWithBackgroundCompute final : public UObject
{
public:
	uint8                                         Pad_28[0x30];                                      // 0x0028(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class UPreviewMesh*                           PreviewMesh;                                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             StandardMaterials;                                 // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     OverrideMaterial;                                  // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     WorkingMaterial;                                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x10];                                      // 0x0080(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshOpPreviewWithBackgroundCompute")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshOpPreviewWithBackgroundCompute")
	}
	static class UMeshOpPreviewWithBackgroundCompute* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshOpPreviewWithBackgroundCompute>();
	}
};
DUMPER7_ASSERTS_UMeshOpPreviewWithBackgroundCompute;

// Class ModelingComponents.MeshReplacementCommandChangeTarget
// 0x0000 (0x0000 - 0x0000)
class IMeshReplacementCommandChangeTarget final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshReplacementCommandChangeTarget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshReplacementCommandChangeTarget")
	}
	static class IMeshReplacementCommandChangeTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMeshReplacementCommandChangeTarget>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMeshReplacementCommandChangeTarget;

// Class ModelingComponents.MeshVertexCommandChangeTarget
// 0x0000 (0x0000 - 0x0000)
class IMeshVertexCommandChangeTarget final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshVertexCommandChangeTarget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshVertexCommandChangeTarget")
	}
	static class IMeshVertexCommandChangeTarget* GetDefaultObj()
	{
		return GetDefaultObjImpl<IMeshVertexCommandChangeTarget>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IMeshVertexCommandChangeTarget;

// Class ModelingComponents.MultiTransformer
// 0x0118 (0x0140 - 0x0028)
class alignas(0x10) UMultiTransformer final : public UObject
{
public:
	uint8                                         Pad_28[0x48];                                      // 0x0028(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	class UInteractiveGizmoManager*               GizmoManager;                                      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x68];                                      // 0x0078(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	class UTransformGizmo*                        TransformGizmo;                                    // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTransformProxy*                        TransformProxy;                                    // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F0[0x50];                                      // 0x00F0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MultiTransformer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MultiTransformer")
	}
	static class UMultiTransformer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMultiTransformer>();
	}
};
DUMPER7_ASSERTS_UMultiTransformer;

// Class ModelingComponents.OctreeDynamicMeshComponent
// 0x0110 (0x05D0 - 0x04C0)
class UOctreeDynamicMeshComponent final : public UBaseDynamicMeshComponent
{
public:
	uint8                                         Pad_4C0[0x18];                                     // 0x04C0(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bExplicitShowWireframe;                            // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4D9[0xF7];                                     // 0x04D9(0x00F7)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OctreeDynamicMeshComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OctreeDynamicMeshComponent")
	}
	static class UOctreeDynamicMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOctreeDynamicMeshComponent>();
	}
};
DUMPER7_ASSERTS_UOctreeDynamicMeshComponent;

// Class ModelingComponents.PlaneDistanceFromHitMechanic
// 0x0470 (0x04A0 - 0x0030)
class UPlaneDistanceFromHitMechanic final : public UInteractionMechanic
{
public:
	uint8                                         Pad_30[0x470];                                     // 0x0030(0x0470)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PlaneDistanceFromHitMechanic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PlaneDistanceFromHitMechanic")
	}
	static class UPlaneDistanceFromHitMechanic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPlaneDistanceFromHitMechanic>();
	}
};
DUMPER7_ASSERTS_UPlaneDistanceFromHitMechanic;

// Class ModelingComponents.PointSetComponent
// 0x0060 (0x04E0 - 0x0480)
class UPointSetComponent final : public UMeshComponent
{
public:
	class UMaterialInterface*                     PointMaterial;                                     // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FBoxSphereBounds                       Bounds;                                            // 0x0480(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          bBoundsDirty;                                      // 0x049C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_49D[0x43];                                     // 0x049D(0x0043)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PointSetComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PointSetComponent")
	}
	static class UPointSetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPointSetComponent>();
	}
};
DUMPER7_ASSERTS_UPointSetComponent;

// Class ModelingComponents.PreviewMesh
// 0x00B8 (0x00E0 - 0x0028)
class UPreviewMesh : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bBuildSpatialDataStructure;                        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDrawOnTop;                                        // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0xE];                                       // 0x0042(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	class USimpleDynamicMeshComponent*            DynamicMeshComponent;                              // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_58[0x88];                                      // 0x0058(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PreviewMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PreviewMesh")
	}
	static class UPreviewMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPreviewMesh>();
	}
};
DUMPER7_ASSERTS_UPreviewMesh;

// Class ModelingComponents.PolyEditPreviewMesh
// 0x03F0 (0x04D0 - 0x00E0)
class UPolyEditPreviewMesh final : public UPreviewMesh
{
public:
	uint8                                         Pad_E0[0x3F0];                                     // 0x00E0(0x03F0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PolyEditPreviewMesh")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PolyEditPreviewMesh")
	}
	static class UPolyEditPreviewMesh* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPolyEditPreviewMesh>();
	}
};
DUMPER7_ASSERTS_UPolyEditPreviewMesh;

// Class ModelingComponents.PolygonSelectionMechanicProperties
// 0x0008 (0x0068 - 0x0060)
class UPolygonSelectionMechanicProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bSelectFaces;                                      // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectEdges;                                      // 0x0061(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectVertices;                                   // 0x0062(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectEdgeLoops;                                  // 0x0063(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectEdgeRings;                                  // 0x0064(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPreferProjectedElement;                           // 0x0065(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelectDownRay;                                    // 0x0066(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreOcclusion;                                  // 0x0067(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PolygonSelectionMechanicProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PolygonSelectionMechanicProperties")
	}
	static class UPolygonSelectionMechanicProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPolygonSelectionMechanicProperties>();
	}
};
DUMPER7_ASSERTS_UPolygonSelectionMechanicProperties;

// Class ModelingComponents.PolygonSelectionMechanic
// 0x0800 (0x0830 - 0x0030)
class alignas(0x10) UPolygonSelectionMechanic final : public UInteractionMechanic
{
public:
	uint8                                         Pad_30[0x20];                                      // 0x0030(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	class UPolygonSelectionMechanicProperties*    Properties;                                        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x4C8];                                     // 0x0058(0x04C8)(Fixing Size After Last Property [ Dumper-7 ])
	class APreviewGeometryActor*                  PreviewGeometryActor;                              // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTriangleSetComponent*                  DrawnTriangleSetComponent;                         // 0x0528(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_530[0x50];                                     // 0x0530(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     HighlightedFaceMaterial;                           // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_588[0x2A8];                                    // 0x0588(0x02A8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PolygonSelectionMechanic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PolygonSelectionMechanic")
	}
	static class UPolygonSelectionMechanic* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPolygonSelectionMechanic>();
	}
};
DUMPER7_ASSERTS_UPolygonSelectionMechanic;

// Class ModelingComponents.PreviewGeometryActor
// 0x0000 (0x0220 - 0x0220)
class APreviewGeometryActor final : public AInternalToolFrameworkActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PreviewGeometryActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PreviewGeometryActor")
	}
	static class APreviewGeometryActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APreviewGeometryActor>();
	}
};
DUMPER7_ASSERTS_APreviewGeometryActor;

// Class ModelingComponents.PreviewGeometry
// 0x0058 (0x0080 - 0x0028)
class UPreviewGeometry final : public UObject
{
public:
	class APreviewGeometryActor*                  ParentActor;                                       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class ULineSetComponent*> LineSets;                                          // 0x0030(0x0050)(ExportObject, ContainsInstancedReference, NativeAccessSpecifierPublic)

public:
	class ULineSetComponent* AddLineSet(const class FString& LineSetIdentifier);
	void CreateInWorld(class UWorld* World, const struct FTransform& WithTransform);
	void Disconnect();
	class ULineSetComponent* FindLineSet(const class FString& LineSetIdentifier);
	void RemoveAllLineSets(bool bDestroy);
	bool RemoveLineSet(const class FString& LineSetIdentifier, bool bDestroy);
	void SetAllLineSetsMaterial(class UMaterialInterface* Material);
	bool SetLineSetMaterial(const class FString& LineSetIdentifier, class UMaterialInterface* NewMaterial);
	bool SetLineSetVisibility(const class FString& LineSetIdentifier, bool bVisible);

	class APreviewGeometryActor* GetActor() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PreviewGeometry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PreviewGeometry")
	}
	static class UPreviewGeometry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPreviewGeometry>();
	}
};
DUMPER7_ASSERTS_UPreviewGeometry;

// Class ModelingComponents.PreviewMeshActor
// 0x0000 (0x0220 - 0x0220)
class APreviewMeshActor final : public AInternalToolFrameworkActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("PreviewMeshActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PreviewMeshActor")
	}
	static class APreviewMeshActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APreviewMeshActor>();
	}
};
DUMPER7_ASSERTS_APreviewMeshActor;

// Class ModelingComponents.SimpleDynamicMeshComponent
// 0x0150 (0x0610 - 0x04C0)
class USimpleDynamicMeshComponent final : public UBaseDynamicMeshComponent
{
public:
	EDynamicMeshTangentCalcType                   TangentsType;                                      // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInvalidateProxyOnChange;                          // 0x04C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C2[0x36];                                     // 0x04C2(0x0036)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bExplicitShowWireframe;                            // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4F9[0x47];                                     // 0x04F9(0x0047)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bDrawOnTop;                                        // 0x0540(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_541[0xCF];                                     // 0x0541(0x00CF)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SimpleDynamicMeshComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimpleDynamicMeshComponent")
	}
	static class USimpleDynamicMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleDynamicMeshComponent>();
	}
};
DUMPER7_ASSERTS_USimpleDynamicMeshComponent;

// Class ModelingComponents.SpaceCurveDeformationMechanicPropertySet
// 0x0010 (0x0070 - 0x0060)
class USpaceCurveDeformationMechanicPropertySet final : public UInteractiveToolPropertySet
{
public:
	ESpaceCurveControlPointTransformMode          TransformMode;                                     // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESpaceCurveControlPointOriginMode             TransformOrigin;                                   // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Softness;                                          // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESpaceCurveControlPointFalloffType            SoftFalloff;                                       // 0x006C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpaceCurveDeformationMechanicPropertySet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpaceCurveDeformationMechanicPropertySet")
	}
	static class USpaceCurveDeformationMechanicPropertySet* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpaceCurveDeformationMechanicPropertySet>();
	}
};
DUMPER7_ASSERTS_USpaceCurveDeformationMechanicPropertySet;

// Class ModelingComponents.SpaceCurveDeformationMechanic
// 0x0280 (0x02B0 - 0x0030)
class alignas(0x10) USpaceCurveDeformationMechanic final : public UInteractionMechanic
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class USingleClickInputBehavior*              ClickBehavior;                                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMouseHoverBehavior*                    HoverBehavior;                                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x18];                                      // 0x0050(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class USpaceCurveDeformationMechanicPropertySet* TransformProperties;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0xF8];                                      // 0x0070(0x00F8)(Fixing Size After Last Property [ Dumper-7 ])
	class APreviewGeometryActor*                  PreviewGeometryActor;                              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPointSetComponent*                     RenderPoints;                                      // 0x0170(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULineSetComponent*                      RenderSegments;                                    // 0x0178(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_180[0x38];                                     // 0x0180(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	class UTransformProxy*                        PointTransformProxy;                               // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTransformGizmo*                        PointTransformGizmo;                               // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1C8[0xE8];                                     // 0x01C8(0x00E8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpaceCurveDeformationMechanic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpaceCurveDeformationMechanic")
	}
	static class USpaceCurveDeformationMechanic* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpaceCurveDeformationMechanic>();
	}
};
DUMPER7_ASSERTS_USpaceCurveDeformationMechanic;

// Class ModelingComponents.SpatialCurveDistanceMechanic
// 0x03C0 (0x03F0 - 0x0030)
class USpatialCurveDistanceMechanic final : public UInteractionMechanic
{
public:
	uint8                                         Pad_30[0x3C0];                                     // 0x0030(0x03C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpatialCurveDistanceMechanic")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpatialCurveDistanceMechanic")
	}
	static class USpatialCurveDistanceMechanic* GetDefaultObj()
	{
		return GetDefaultObjImpl<USpatialCurveDistanceMechanic>();
	}
};
DUMPER7_ASSERTS_USpatialCurveDistanceMechanic;

// Class ModelingComponents.TriangleSetComponent
// 0x00E0 (0x0560 - 0x0480)
class UTriangleSetComponent final : public UMeshComponent
{
public:
	struct FBoxSphereBounds                       Bounds;                                            // 0x0478(0x001C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                          bBoundsDirty;                                      // 0x0494(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_495[0xCB];                                     // 0x0495(0x00CB)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TriangleSetComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TriangleSetComponent")
	}
	static class UTriangleSetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTriangleSetComponent>();
	}
};
DUMPER7_ASSERTS_UTriangleSetComponent;

// Class ModelingComponents.UVLayoutPreviewProperties
// 0x0018 (0x0078 - 0x0060)
class UUVLayoutPreviewProperties final : public UInteractiveToolPropertySet
{
public:
	bool                                          bVisible;                                          // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ScaleFactor;                                       // 0x0064(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUVLayoutPreviewSide                          WhichSide;                                         // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowWireframe;                                    // 0x006C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Shift;                                             // 0x0070(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UVLayoutPreviewProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UVLayoutPreviewProperties")
	}
	static class UUVLayoutPreviewProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVLayoutPreviewProperties>();
	}
};
DUMPER7_ASSERTS_UUVLayoutPreviewProperties;

// Class ModelingComponents.UVLayoutPreview
// 0x0118 (0x0140 - 0x0028)
class alignas(0x10) UUVLayoutPreview final : public UObject
{
public:
	class UUVLayoutPreviewProperties*             Settings;                                          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPreviewMesh*                           PreviewMesh;                                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTriangleSetComponent*                  TriangleComponent;                                 // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowBackingRectangle;                             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     BackingRectangleMaterial;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0xF0];                                      // 0x0050(0x00F0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UVLayoutPreview")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UVLayoutPreview")
	}
	static class UUVLayoutPreview* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUVLayoutPreview>();
	}
};
DUMPER7_ASSERTS_UUVLayoutPreview;

// Class ModelingComponents.VoxelProperties
// 0x0018 (0x0078 - 0x0060)
class UVoxelProperties final : public UInteractiveToolPropertySet
{
public:
	int32                                         VoxelCount;                                        // 0x0060(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoSimplify;                                     // 0x0064(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRemoveInternalSurfaces;                           // 0x0065(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SimplifyMaxErrorFactor;                            // 0x0068(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        CubeRootMinComponentVolume;                        // 0x0070(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("VoxelProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"VoxelProperties")
	}
	static class UVoxelProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVoxelProperties>();
	}
};
DUMPER7_ASSERTS_UVoxelProperties;

// Class ModelingComponents.WeightMapSetProperties
// 0x0020 (0x0080 - 0x0060)
class UWeightMapSetProperties : public UInteractiveToolPropertySet
{
public:
	class FName                                   WeightMap;                                         // 0x0060(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         WeightMapsList;                                    // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bInvertWeightMap;                                  // 0x0078(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<class FString> GetWeightMapsFunc();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WeightMapSetProperties")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WeightMapSetProperties")
	}
	static class UWeightMapSetProperties* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeightMapSetProperties>();
	}
};
DUMPER7_ASSERTS_UWeightMapSetProperties;

SDK_NAMESPACE_END
