#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ObjectManagementSystemDataBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectP_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass ObjectManagementSystemDataBP.ObjectManagementSystemDataBP_C
// 0x0070 (0x0290 - 0x0220)
class AObjectManagementSystemDataBP_C final : public ALObjectManagementSystemData
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        LevelPreloadHolder;                                // 0x0230(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UObject*>                        BodyStainPreloadHolder;                            // 0x0240(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UObject*>                        WeaponMaterialPreloadHolder;                       // 0x0250(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UObject*>                        ActionPreloadHolder;                               // 0x0260(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                         ClassPreloadHolder;                                // 0x0270(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   AnimMontagePreloadHolder;                          // 0x0280(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_ObjectManagementSystemDataBP(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ObjectManagementSystemDataBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ObjectManagementSystemDataBP_C")
	}
	static class AObjectManagementSystemDataBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AObjectManagementSystemDataBP_C>();
	}
};
DUMPER7_ASSERTS_AObjectManagementSystemDataBP_C;

SDK_NAMESPACE_END
