#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionSystemDataBP

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass OptionSystemDataBP.OptionSystemDataBP_C
// 0x0180 (0x05F8 - 0x0478)
class AOptionSystemDataBP_C final : public ALOptionSystemData
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 Selectable_Pad_VerticalCameraSpeed;                // 0x0480(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 Selectable_BGMVolumes;                             // 0x0490(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 Selectable_EffectVolumes;                          // 0x04A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 Selectable_VoiceVolumes;                           // 0x04B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                         Selectable_Languages;                              // 0x04C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Default_UseAutoNewTargetLockOn;                    // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EPlayStyleOption                              Default_PlayStyle;                                 // 0x04D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D2[0x2];                                      // 0x04D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Default_VerticalCameraSpeedIdx;                    // 0x04D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Default_VerticalCameraInvert;                      // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Default_HorizontalCameraInvert;                    // 0x04D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Default_VSyncEnabled;                              // 0x04DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EWindowMode                                   Default_FullscreenMode;                            // 0x04DB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Default_BGMVolumeIdx;                              // 0x04DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Default_EffectVolumIdx;                            // 0x04E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Default_VoiceVolumIdx;                             // 0x04E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Default_InputPresetName_GamePad;                   // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Default_InputPresetName_Keyboard;                  // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Default_Language;                                  // 0x04F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<float>                                 Selectable_Pad_HorizontalCameraSpeed;              // 0x0508(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Default_HorizontalCameraSpeedIdx;                  // 0x0518(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Default_UseAutoTargeting;                          // 0x051C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51D[0x3];                                      // 0x051D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 Selectable_Mouse_VerticalCameraSpeed;              // 0x0520(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 Selectable_Mouse_HorizontalCameraSpeed;            // 0x0530(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	ELScalabilityLevel                            Default_ScalabilityLevel;                          // 0x0540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELHUDVisible                                  Default_HUDVisibility;                             // 0x0541(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Default_EnableMotionBlur;                          // 0x0542(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Default_EnableTutorialPopup;                       // 0x0543(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         Default_LockOnImportanceWeightMultiply;            // 0x0544(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLLockOnImportanceWeight>       Selectable_LockOnImportanceWeightMultiply;         // 0x0548(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Default_EnableMoveCameraUpDown;                    // 0x0558(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Default_EnableAlignmentToCamera;                   // 0x0559(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Default_EnableCameraShake;                         // 0x055A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55B[0x5];                                      // 0x055B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 Selectable_AmbienceVolumes;                        // 0x0560(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 Selectable_CinematicsVolumes;                      // 0x0570(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 Selectable_SystemVolumes;                          // 0x0580(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 Selectable_MasterVolumes;                          // 0x0590(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Default_MasterVolumeIdx;                           // 0x05A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Default_AmbienceVolumeIdx;                         // 0x05A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Default_CinematicsVolumeIdx;                       // 0x05A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Default_SystemVolumeIdx;                           // 0x05AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Default_EnableBloodExpression;                     // 0x05B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B1[0x3];                                      // 0x05B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Default_FramerateLimit;                            // 0x05B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 Selectable_ForceFeedback_Multiply;                 // 0x05B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 Selectable_DeadZone_L;                             // 0x05C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<float>                                 Selectable_DeadZone_R;                             // 0x05D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Default_EnableVideoSubtitle;                       // 0x05E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E9[0x3];                                      // 0x05E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Default_DeadZone_Idx_L;                            // 0x05EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Default_DeadZone_Idx_R;                            // 0x05F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Default_ForceFeedback_Idx;                         // 0x05F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool GetDefaultUseAutoNewTargetLockOn();
	EPlayStyleOption GetDefaultPlayStyleOption();
	TArray<float> GetSelectableCameraSpeeds(ECameraDirectOption InRotator, bool IsPad);
	int32 GetDefaultCameraSpeedIdx(ECameraDirectOption InRotator);
	bool GetDefaultCameraInvert(ECameraDirectOption InRotator);
	EWindowMode GetDefaultFullscreenMode();
	bool GetDefaultVSyncEnabled();
	TArray<float> GetSelectableVolumes(ELVolumeType InType);
	int32 GetDefaultVolumeIdx(ELVolumeType InType);
	class FName GetDefaultInputPresetName(bool IsGamePad);
	TArray<class FString> GetSelectableLanguages();
	class FString GetDefaultLanguage();
	struct FIntPoint GetDefaultScreenResolution();
	bool GetDefaultUseAutoTargeting();
	ELScalabilityLevel GetDefaultScalabilityLevel();
	bool GetDefaultEnableMotionBlur();
	bool GetDefaultEnableTutorialPopup();
	int32 GetDefaultLockOnImportanceWeightMultiply();
	TArray<struct FLLockOnImportanceWeight> GetSelectableLockOnImportanceWeightMultiply();
	bool GetDefault_EnableAlignmentToCamera();
	bool GetDefault_EnableCameraShake();
	bool GetDefault_EnableMoveCameraUpDown();
	ELHUDVisible GetDefaultHUDVisibility();
	bool GetDefaultEnableBloodExpression();
	float GetDefaultFramerateLimit();
	bool GetDefaultEnableVideoSubtitle();
	TArray<float> GetSelectableDeadZone(bool LeftStick);
	TArray<float> GetSelectableForceFeedback();
	int32 GetDefaultDeadZoneIdx(bool LeftStick);
	int32 GetDefaultForceFeedbackIdx();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("OptionSystemDataBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OptionSystemDataBP_C")
	}
	static class AOptionSystemDataBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AOptionSystemDataBP_C>();
	}
};
DUMPER7_ASSERTS_AOptionSystemDataBP_C;

SDK_NAMESPACE_END
