#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OptionSystemDataBP

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetDefaultUseAutoNewTargetLockOn
// 0x0001 (0x0001 - 0x0000)
struct OptionSystemDataBP_C_GetDefaultUseAutoNewTargetLockOn final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetDefaultUseAutoNewTargetLockOn;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetDefaultPlayStyleOption
// 0x0001 (0x0001 - 0x0000)
struct OptionSystemDataBP_C_GetDefaultPlayStyleOption final
{
public:
	EPlayStyleOption                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetDefaultPlayStyleOption;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetSelectableCameraSpeeds
// 0x0020 (0x0020 - 0x0000)
struct OptionSystemDataBP_C_GetSelectableCameraSpeeds final
{
public:
	ECameraDirectOption                           InRotator;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPad;                                             // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetSelectableCameraSpeeds;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetDefaultCameraSpeedIdx
// 0x000C (0x000C - 0x0000)
struct OptionSystemDataBP_C_GetDefaultCameraSpeedIdx final
{
public:
	ECameraDirectOption                           InRotator;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetDefaultCameraSpeedIdx;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetDefaultCameraInvert
// 0x0003 (0x0003 - 0x0000)
struct OptionSystemDataBP_C_GetDefaultCameraInvert final
{
public:
	ECameraDirectOption                           InRotator;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetDefaultCameraInvert;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetDefaultFullscreenMode
// 0x0001 (0x0001 - 0x0000)
struct OptionSystemDataBP_C_GetDefaultFullscreenMode final
{
public:
	EWindowMode                                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetDefaultFullscreenMode;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetDefaultVSyncEnabled
// 0x0001 (0x0001 - 0x0000)
struct OptionSystemDataBP_C_GetDefaultVSyncEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetDefaultVSyncEnabled;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetSelectableVolumes
// 0x0020 (0x0020 - 0x0000)
struct OptionSystemDataBP_C_GetSelectableVolumes final
{
public:
	ELVolumeType                                  InType;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetSelectableVolumes;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetDefaultVolumeIdx
// 0x000C (0x000C - 0x0000)
struct OptionSystemDataBP_C_GetDefaultVolumeIdx final
{
public:
	ELVolumeType                                  InType;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetDefaultVolumeIdx;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetDefaultInputPresetName
// 0x000C (0x000C - 0x0000)
struct OptionSystemDataBP_C_GetDefaultInputPresetName final
{
public:
	bool                                          IsGamePad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ReturnValue;                                       // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetDefaultInputPresetName;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetSelectableLanguages
// 0x0010 (0x0010 - 0x0000)
struct OptionSystemDataBP_C_GetSelectableLanguages final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetSelectableLanguages;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetDefaultLanguage
// 0x0010 (0x0010 - 0x0000)
struct OptionSystemDataBP_C_GetDefaultLanguage final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetDefaultLanguage;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetDefaultScreenResolution
// 0x0018 (0x0018 - 0x0000)
struct OptionSystemDataBP_C_GetDefaultScreenResolution final
{
public:
	struct FIntPoint                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_GetDesktopResolution_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetDefaultScreenResolution;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetDefaultUseAutoTargeting
// 0x0001 (0x0001 - 0x0000)
struct OptionSystemDataBP_C_GetDefaultUseAutoTargeting final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetDefaultUseAutoTargeting;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetDefaultScalabilityLevel
// 0x0001 (0x0001 - 0x0000)
struct OptionSystemDataBP_C_GetDefaultScalabilityLevel final
{
public:
	ELScalabilityLevel                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetDefaultScalabilityLevel;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetDefaultEnableMotionBlur
// 0x0001 (0x0001 - 0x0000)
struct OptionSystemDataBP_C_GetDefaultEnableMotionBlur final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetDefaultEnableMotionBlur;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetDefaultEnableTutorialPopup
// 0x0001 (0x0001 - 0x0000)
struct OptionSystemDataBP_C_GetDefaultEnableTutorialPopup final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetDefaultEnableTutorialPopup;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetDefaultLockOnImportanceWeightMultiply
// 0x0004 (0x0004 - 0x0000)
struct OptionSystemDataBP_C_GetDefaultLockOnImportanceWeightMultiply final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetDefaultLockOnImportanceWeightMultiply;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetSelectableLockOnImportanceWeightMultiply
// 0x0010 (0x0010 - 0x0000)
struct OptionSystemDataBP_C_GetSelectableLockOnImportanceWeightMultiply final
{
public:
	TArray<struct FLLockOnImportanceWeight>       ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetSelectableLockOnImportanceWeightMultiply;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetDefault_EnableAlignmentToCamera
// 0x0001 (0x0001 - 0x0000)
struct OptionSystemDataBP_C_GetDefault_EnableAlignmentToCamera final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetDefault_EnableAlignmentToCamera;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetDefault_EnableCameraShake
// 0x0001 (0x0001 - 0x0000)
struct OptionSystemDataBP_C_GetDefault_EnableCameraShake final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetDefault_EnableCameraShake;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetDefault_EnableMoveCameraUpDown
// 0x0001 (0x0001 - 0x0000)
struct OptionSystemDataBP_C_GetDefault_EnableMoveCameraUpDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetDefault_EnableMoveCameraUpDown;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetDefaultHUDVisibility
// 0x0001 (0x0001 - 0x0000)
struct OptionSystemDataBP_C_GetDefaultHUDVisibility final
{
public:
	ELHUDVisible                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetDefaultHUDVisibility;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetDefaultEnableBloodExpression
// 0x0001 (0x0001 - 0x0000)
struct OptionSystemDataBP_C_GetDefaultEnableBloodExpression final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetDefaultEnableBloodExpression;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetDefaultFramerateLimit
// 0x0004 (0x0004 - 0x0000)
struct OptionSystemDataBP_C_GetDefaultFramerateLimit final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetDefaultFramerateLimit;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetDefaultEnableVideoSubtitle
// 0x0001 (0x0001 - 0x0000)
struct OptionSystemDataBP_C_GetDefaultEnableVideoSubtitle final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetDefaultEnableVideoSubtitle;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetSelectableDeadZone
// 0x0018 (0x0018 - 0x0000)
struct OptionSystemDataBP_C_GetSelectableDeadZone final
{
public:
	bool                                          LeftStick;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetSelectableDeadZone;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetSelectableForceFeedback
// 0x0010 (0x0010 - 0x0000)
struct OptionSystemDataBP_C_GetSelectableForceFeedback final
{
public:
	TArray<float>                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetSelectableForceFeedback;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetDefaultDeadZoneIdx
// 0x0008 (0x0008 - 0x0000)
struct OptionSystemDataBP_C_GetDefaultDeadZoneIdx final
{
public:
	bool                                          LeftStick;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetDefaultDeadZoneIdx;

// Function OptionSystemDataBP.OptionSystemDataBP_C.GetDefaultForceFeedbackIdx
// 0x0004 (0x0004 - 0x0000)
struct OptionSystemDataBP_C_GetDefaultForceFeedbackIdx final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_OptionSystemDataBP_C_GetDefaultForceFeedbackIdx;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
