#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ProjectPContentInfo

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetAbstateBuffdebuffType
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetAbstateBuffdebuffType final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ELAbnormalBuffDebuffType                      ReturnValue;                                       // 0x0218(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetAbstateBuffdebuffType;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetAbstateClass
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetAbstateClass final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ELAbnormalAbstateClass                        ReturnValue;                                       // 0x0218(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetAbstateClass;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetActionStateArray
// 0x0228 (0x0228 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetActionStateArray final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FActionStateType>               ReturnValue;                                       // 0x0218(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetActionStateArray;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetActivationType
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetActivationType final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ELAbnormalActivation                          ReturnValue;                                       // 0x0218(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetActivationType;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetApplyBuildUpRecoverIncrease
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetApplyBuildUpRecoverIncrease final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0218(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetApplyBuildUpRecoverIncrease;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetApplyDurationPenalty
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetApplyDurationPenalty final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0218(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetApplyDurationPenalty;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetApplyTickPenalty
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetApplyTickPenalty final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0218(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetApplyTickPenalty;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetAttachActionCommand
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetAttachActionCommand final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0218(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetAttachActionCommand;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetAttachFxCodeName
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetAttachFxCodeName final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0218(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetAttachFxCodeName;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetAttachFxSocket
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetAttachFxSocket final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0218(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetAttachFxSocket;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetAttachMotion
// 0x0240 (0x0240 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetAttachMotion final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                 ReturnValue;                                       // 0x0218(0x0028)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetAttachMotion;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetAuraAbnormalCodeName
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetAuraAbnormalCodeName final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0218(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetAuraAbnormalCodeName;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetAuraNpcKind
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetAuraNpcKind final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ELNPCType                                     ReturnValue;                                       // 0x0218(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetAuraNpcKind;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetAuraRadius
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetAuraRadius final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0218(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetAuraRadius;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetBuildUpAttack
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetBuildUpAttack final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0218(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetBuildUpAttack;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetBuildUpAttackGuardType
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetBuildUpAttackGuardType final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ELBuildupGuardType                            ReturnValue;                                       // 0x0218(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetBuildUpAttackGuardType;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetBuildUpRecoverDelayOverride
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetBuildUpRecoverDelayOverride final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0218(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetBuildUpRecoverDelayOverride;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetBuildUpRecoverOverride
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetBuildUpRecoverOverride final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0218(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetBuildUpRecoverOverride;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetCodeName
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetCodeName final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0218(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetCodeName;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetContentconditionCodeName
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetContentconditionCodeName final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0218(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetContentconditionCodeName;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetDecreaseFrenzyPointPerSecond
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetDecreaseFrenzyPointPerSecond final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0218(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetDecreaseFrenzyPointPerSecond;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetDetachFxCodeName
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetDetachFxCodeName final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0218(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetDetachFxCodeName;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetDetachFxSocket
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetDetachFxSocket final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0218(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetDetachFxSocket;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetDetachMotion
// 0x0240 (0x0240 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetDetachMotion final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                 ReturnValue;                                       // 0x0218(0x0028)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetDetachMotion;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetDisableContentconditionCodeName
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetDisableContentconditionCodeName final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0218(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetDisableContentconditionCodeName;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetDuration
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetDuration final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0218(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetDuration;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetDurationModifyCalType
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetDurationModifyCalType final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ELAbnormalCSCalcType                          ReturnValue;                                       // 0x0218(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetDurationModifyCalType;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetDurationModifyMoment
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetDurationModifyMoment final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0218(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetDurationModifyMoment;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetDurationModifyMomentTarget
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetDurationModifyMomentTarget final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ELStateEffectTargetType                       ReturnValue;                                       // 0x0218(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetDurationModifyMomentTarget;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetDurationModifyValue
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetDurationModifyValue final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0218(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetDurationModifyValue;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetEnchantSdType
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetEnchantSdType final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ELAbnormalEnchantType                         ReturnValue;                                       // 0x0218(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetEnchantSdType;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetGroupCodeName
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetGroupCodeName final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0218(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetGroupCodeName;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetHumanizationBuffAlterCodeName
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetHumanizationBuffAlterCodeName final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0218(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetHumanizationBuffAlterCodeName;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetIconResource
// 0x0240 (0x0240 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetIconResource final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                 ReturnValue;                                       // 0x0218(0x0028)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetIconResource;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetIgnoreSensitiveRange
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetIgnoreSensitiveRange final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0218(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetIgnoreSensitiveRange;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetIsFableBuff
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetIsFableBuff final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0218(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetIsFableBuff;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetIsWeaponEnchant
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetIsWeaponEnchant final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0218(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetIsWeaponEnchant;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetKeepDead
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetKeepDead final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0218(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetKeepDead;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetKeepLogout
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetKeepLogout final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0218(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetKeepLogout;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetKeepRespawn
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetKeepRespawn final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0218(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetKeepRespawn;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetLoopFxCodeName
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetLoopFxCodeName final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0218(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetLoopFxCodeName;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetLoopFxSocket
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetLoopFxSocket final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0218(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetLoopFxSocket;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetLoopMotion
// 0x0240 (0x0240 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetLoopMotion final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                 ReturnValue;                                       // 0x0218(0x0028)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetLoopMotion;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetMaterialFxCodeName
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetMaterialFxCodeName final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0218(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetMaterialFxCodeName;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetMomentconditionCodeName
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetMomentconditionCodeName final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0218(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetMomentconditionCodeName;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetMomentconditionCount
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetMomentconditionCount final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0218(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetMomentconditionCount;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetMomentconditionProbability
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetMomentconditionProbability final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0218(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetMomentconditionProbability;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetMomentconditionTarget
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetMomentconditionTarget final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ELStateEffectTargetType                       ReturnValue;                                       // 0x0218(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetMomentconditionTarget;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetName
// 0x0228 (0x0228 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetName final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0218(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetName;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetNameCn
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetNameCn final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0218(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetNameCn;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetNameLocalize
// 0x0230 (0x0230 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetNameLocalize final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0218(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetNameLocalize;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetPriority
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetPriority final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0218(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetPriority;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetPriorityGroupId
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetPriorityGroupId final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0218(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetPriorityGroupId;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetShowUi
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetShowUi final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0218(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetShowUi;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetStackType
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetStackType final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ELAbnormalStackType                           ReturnValue;                                       // 0x0218(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetStackType;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetTick
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetTick final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0218(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetTick;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetTimeoutBuffCodeName
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetTimeoutBuffCodeName final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0218(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetTimeoutBuffCodeName;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetTooltip
// 0x0228 (0x0228 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetTooltip final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0218(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetTooltip;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetTooltipCn
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetTooltipCn final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0218(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetTooltipCn;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetTooltipLocalize
// 0x0230 (0x0230 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetTooltipLocalize final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0218(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetTooltipLocalize;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetVaryingFxCodeName
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetVaryingFxCodeName final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0218(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetVaryingFxCodeName;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetWeaponAnimPartsType
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetWeaponAnimPartsType final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ELWeaponPartType                              ReturnValue;                                       // 0x0218(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetWeaponAnimPartsType;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetWeaponAnimState
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetWeaponAnimState final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0218(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetWeaponAnimState;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetWeaponAnimStateExit
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetWeaponAnimStateExit final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0218(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetWeaponAnimStateExit;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetWeaponAttachPointType
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetWeaponAttachPointType final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ELWeaponAttachPointType                       ReturnValue;                                       // 0x0218(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetWeaponAttachPointType;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetWeaponElementOverride
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetWeaponElementOverride final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	ELElementDamageType                           ReturnValue;                                       // 0x0218(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetWeaponElementOverride;

// Function ProjectPContentInfo.AbnormalStateCommonInfoFuncLibrary.GetWeaponMaterialFxCodeName
// 0x0220 (0x0220 - 0x0000)
struct AbnormalStateCommonInfoFuncLibrary_GetWeaponMaterialFxCodeName final
{
public:
	struct FAbnormalStateCommonInfo               Info;                                              // 0x0000(0x0218)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0218(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoFuncLibrary_GetWeaponMaterialFxCodeName;

// Function ProjectPContentInfo.AbnormalStateCommonInfoPtrFuncLibrary.GetAbstateBuffdebuffType
// 0x0010 (0x0010 - 0x0000)
struct AbnormalStateCommonInfoPtrFuncLibrary_GetAbstateBuffdebuffType final
{
public:
	struct FAbnormalStateCommonInfoPtr            Ptr;                                               // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	ELAbnormalBuffDebuffType                      ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoPtrFuncLibrary_GetAbstateBuffdebuffType;

// Function ProjectPContentInfo.AbnormalStateCommonInfoPtrFuncLibrary.GetAbstateClass
// 0x0010 (0x0010 - 0x0000)
struct AbnormalStateCommonInfoPtrFuncLibrary_GetAbstateClass final
{
public:
	struct FAbnormalStateCommonInfoPtr            Ptr;                                               // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	ELAbnormalAbstateClass                        ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoPtrFuncLibrary_GetAbstateClass;

// Function ProjectPContentInfo.AbnormalStateCommonInfoPtrFuncLibrary.GetActionStateArray
// 0x0018 (0x0018 - 0x0000)
struct AbnormalStateCommonInfoPtrFuncLibrary_GetActionStateArray final
{
public:
	struct FAbnormalStateCommonInfoPtr            Ptr;                                               // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FActionStateType>               ReturnValue;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoPtrFuncLibrary_GetActionStateArray;

// Function ProjectPContentInfo.AbnormalStateCommonInfoPtrFuncLibrary.GetActivationType
// 0x0010 (0x0010 - 0x0000)
struct AbnormalStateCommonInfoPtrFuncLibrary_GetActivationType final
{
public:
	struct FAbnormalStateCommonInfoPtr            Ptr;                                               // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	ELAbnormalActivation                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoPtrFuncLibrary_GetActivationType;

// Function ProjectPContentInfo.AbnormalStateCommonInfoPtrFuncLibrary.GetApplyBuildUpRecoverIncrease
// 0x0010 (0x0010 - 0x0000)
struct AbnormalStateCommonInfoPtrFuncLibrary_GetApplyBuildUpRecoverIncrease final
{
public:
	struct FAbnormalStateCommonInfoPtr            Ptr;                                               // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoPtrFuncLibrary_GetApplyBuildUpRecoverIncrease;

// Function ProjectPContentInfo.AbnormalStateCommonInfoPtrFuncLibrary.GetApplyDurationPenalty
// 0x0010 (0x0010 - 0x0000)
struct AbnormalStateCommonInfoPtrFuncLibrary_GetApplyDurationPenalty final
{
public:
	struct FAbnormalStateCommonInfoPtr            Ptr;                                               // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoPtrFuncLibrary_GetApplyDurationPenalty;

// Function ProjectPContentInfo.AbnormalStateCommonInfoPtrFuncLibrary.GetApplyTickPenalty
// 0x0010 (0x0010 - 0x0000)
struct AbnormalStateCommonInfoPtrFuncLibrary_GetApplyTickPenalty final
{
public:
	struct FAbnormalStateCommonInfoPtr            Ptr;                                               // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoPtrFuncLibrary_GetApplyTickPenalty;

// Function ProjectPContentInfo.AbnormalStateCommonInfoPtrFuncLibrary.GetAttachActionCommand
// 0x0010 (0x0010 - 0x0000)
struct AbnormalStateCommonInfoPtrFuncLibrary_GetAttachActionCommand final
{
public:
	struct FAbnormalStateCommonInfoPtr            Ptr;                                               // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbnormalStateCommonInfoPtrFuncLibrary_GetAttachActionCommand;

// Function ProjectPContentInfo.AbnormalStateCommonInfoPtrFuncLibrary.GetAttachFxCodeName
