#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SoundSystemDataBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectP_classes.hpp"
#include "ProjectPContentInfo_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass SoundSystemDataBP.SoundSystemDataBP_C
// 0x0078 (0x02A0 - 0x0228)
class ASoundSystemDataBP_C final : public ALSoundSystemData
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        BGMComp;                                           // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PlayingBGM;                                        // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeOutBGM;                                        // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        RecordComp;                                        // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timer;                                             // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        DialogSoundComp;                                   // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PlayingDialogCodeName;                             // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Record_IntentionStop;                              // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundMix*                              PushedMixModifier;                                 // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundMix*                              DialogSoundMix_Dialog2D;                           // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundMix*                              DialogSoundMix_Dialog3D;                           // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundMix*                              DialogSoundMix_Monologue2D;                        // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundMix*                              DialogSoundMix_Monologue3D;                        // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SoundSystemDataBP(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void OnCompletePlayDialogSound();
	void OnFadeMuteSound(bool bMute);
	void SpawnPlayBGM(class FName SoundName, float DelayTime);
	class USoundMix* GetBaseSoundMix();
	void OnPlayBGM(class FName SoundName, bool* PlayResult);
	void OnStopBGM();
	bool OnPlayRecord(class FName RecordCodeName, class ALPropSpot* InSoundSource);
	bool OnStopRecord();
	void On_Finish_Record();
	void OnRecordPlaybackPercent(const class USoundWave* PlayingSoundWave, const float PlaybackPercent);
	bool OnPlayDialogSound(const struct FDialogInfoPtr& InDialog);
	bool OnStopDialogSound();
	void GetGlobalMuteSoundMixes(TArray<class USoundMix*>* MuteMixes);
	void OnCompleteDialogSound();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SoundSystemDataBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SoundSystemDataBP_C")
	}
	static class ASoundSystemDataBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASoundSystemDataBP_C>();
	}
};
DUMPER7_ASSERTS_ASoundSystemDataBP_C;

SDK_NAMESPACE_END
