#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SubstanceCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SubstanceCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// Class SubstanceCore.SubstanceGraphInstance
// 0x0150 (0x0178 - 0x0028)
class USubstanceGraphInstance final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PackageURL;                                        // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USubstanceInstanceFactory*              ParentFactory;                                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<uint32, class UTexture2D*>               ImageSources;                                      // 0x0050(0x0050)(NativeAccessSpecifierPublic)
	class UMaterial*                              CreatedMaterial;                                   // 0x00A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceConstant*              ConstantCreatedMaterial;                           // 0x00A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               DynamicCreatedMaterial;                            // 0x00B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<int32, struct FGuid>                     OutputTextureLinkData;                             // 0x00B8(0x0050)(NativeAccessSpecifierPublic)
	TMap<uint32, class USubstanceOutputData*>     OutputInstances;                                   // 0x0108(0x0050)(NativeAccessSpecifierPublic)
	bool                                          bIsFrozen;                                         // 0x0158(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_159[0x1F];                                     // 0x0159(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CreateMaterial(const class FString& PackageName, class UMaterial* ParentMaterial);
	void CreateOutputs();
	class USubstanceGraphInstance* Duplicate();
	void EnableOutput(const class FString& Identifier, bool Value);
	class UMaterialInstanceConstant* GetConstantMaterial();
	class UMaterialInstanceDynamic* GetDynamicMaterialInstance(class FName Name_0, class UMaterial* InParentMaterial);
	struct FSubstanceFloatInputDesc GetFloatInputDesc(const class FString& Identifier);
	bool GetInputBool(const class FString& Identifier);
	struct FLinearColor GetInputColor(const class FString& Identifier);
	TArray<float> GetInputFloat(const class FString& Identifier);
	TArray<int32> GetInputInt(const class FString& Identifier);
	TArray<class FString> GetInputNames();
	class FString GetInputString(const class FString& Identifier);
	ESubstanceInputType GetInputType(const class FString& InputName);
	struct FSubstanceInstanceDesc GetInstanceDesc();
	struct FSubstanceIntInputDesc GetIntInputDesc(const class FString& Identifier);
	TArray<class FString> GetOutputNames();
	void RenderSync();
	void SetInputBool(const class FString& Identifier, bool Bool);
	void SetInputColor(const class FString& Identifier, const struct FLinearColor& Color);
	void SetInputFloat(const class FString& Identifier, const TArray<float>& InputValues);
	bool SetInputImg(const class FString& InputName, class UObject* Value);
	void SetInputInt(const class FString& Identifier, const TArray<int32>& InputValues);
	void SetInputString(const class FString& Identifier, const class FString& Value);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SubstanceGraphInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SubstanceGraphInstance")
	}
	static class USubstanceGraphInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubstanceGraphInstance>();
	}
};
DUMPER7_ASSERTS_USubstanceGraphInstance;

// Class SubstanceCore.SubstanceInstanceFactory
// 0x0070 (0x0098 - 0x0028)
class USubstanceInstanceFactory final : public UObject
{
public:
	TArray<class USubstanceGraphInstance*>        mGraphInstances;                                   // 0x0028(0x0010)(ZeroConstructor, DuplicateTransient, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x28];                                      // 0x0038(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RelativeSourceFilePath;                            // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AbsoluteSourceFilePath;                            // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SourceFileTimestamp;                               // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubstanceGenerationMode                      GenerationMode;                                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class USubstanceGraphInstance* CreateGraphInstance(const struct FSubstanceGraphDesc& GraphDesc, const class FString& PackageName);
	const TArray<struct FSubstanceGraphDesc> GetGraphDescs();
	const TArray<class USubstanceGraphInstance*> GetGraphInstances();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SubstanceInstanceFactory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SubstanceInstanceFactory")
	}
	static class USubstanceInstanceFactory* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubstanceInstanceFactory>();
	}
};
DUMPER7_ASSERTS_USubstanceInstanceFactory;

// Class SubstanceCore.SubstanceOutputData
// 0x0030 (0x0058 - 0x0028)
class USubstanceOutputData final : public UObject
{
public:
	class UObject*                                ConnectedObject;                                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMaterialParameterInfo                 ParamInfo;                                         // 0x0030(0x0010)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USubstanceGraphInstance*                ParentInstance;                                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  CacheGuid;                                         // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SubstanceOutputData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SubstanceOutputData")
	}
	static class USubstanceOutputData* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubstanceOutputData>();
	}
};
DUMPER7_ASSERTS_USubstanceOutputData;

// Class SubstanceCore.SubstanceSettings
// 0x0040 (0x0068 - 0x0028)
class USubstanceSettings final : public UObject
{
public:
	int32                                         MemoryBudgetMb;                                    // 0x0028(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CPUCores;                                          // 0x002C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AsyncLoadMipClip;                                  // 0x0030(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxAsyncSubstancesRenderedPerFrame;                // 0x0034(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESubstanceEngineType                          SubstanceEngine;                                   // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDefaultSubstanceTextureSize                  DefaultSubstanceOutputSizeX;                       // 0x0039(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDefaultSubstanceTextureSize                  DefaultSubstanceOutputSizeY;                       // 0x003A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UMaterialInterface>      DefaultTemplateMaterial;                           // 0x0040(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SubstanceSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SubstanceSettings")
	}
	static class USubstanceSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubstanceSettings>();
	}
};
DUMPER7_ASSERTS_USubstanceSettings;

// Class SubstanceCore.SubstanceTexture2D
// 0x0060 (0x01F0 - 0x0190)
class USubstanceTexture2D final : public UTexture2DDynamic
{
public:
	uint8                                         Pad_190[0x30];                                     // 0x0190(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class USubstanceGraphInstance*                ParentInstance;                                    // 0x01C0(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureAddress                               AddressX;                                          // 0x01C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETextureAddress                               AddressY;                                          // 0x01C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCooked;                                           // 0x01CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1CB[0x25];                                     // 0x01CB(0x0025)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SubstanceTexture2D")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SubstanceTexture2D")
	}
	static class USubstanceTexture2D* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubstanceTexture2D>();
	}
};
DUMPER7_ASSERTS_USubstanceTexture2D;

// Class SubstanceCore.SubstanceUtility
// 0x0000 (0x0028 - 0x0028)
class USubstanceUtility final : public UBlueprintFunctionLibrary
{
public:
	static void AsyncRendering(class USubstanceGraphInstance* InstancesToRender);
	static void ClearCache();
	static void CopyInputParameters(class USubstanceGraphInstance* SourceGraphInstance, class USubstanceGraphInstance* DestGraphInstance);
	static class USubstanceInstanceFactory* CreateAggregateSubstanceFactory(class USubstanceInstanceFactory* OutputFactory, int32 OutputFactoryGraphIndex, class USubstanceInstanceFactory* InputFactory, int32 InputFactoryGraphIndex, const TArray<struct FSubstanceConnection>& Connections);
	static class USubstanceGraphInstance* CreateGraphInstance(class UObject* WorldContextObject, class USubstanceInstanceFactory* FactorY, int32 GraphDescIndex, class UMaterial* ParentMaterial, const class FString& InstanceName);
	static void DisableInstanceOutputs(class UObject* WorldContextObject, class USubstanceGraphInstance* GraphInstance, const TArray<int32>& OutputIndices);
	static class USubstanceGraphInstance* DuplicateGraphInstance(class UObject* WorldContextObject, class USubstanceGraphInstance* GraphInstance);
	static void EnableInstanceOutputs(class UObject* WorldContextObject, class USubstanceGraphInstance* GraphInstance, const TArray<int32>& OutputIndices);
	static class FString GetFactoryName(class USubstanceGraphInstance* GraphInstance);
	static class FString GetGraphName(class USubstanceGraphInstance* GraphInstance);
	static TArray<class UMaterial*> GetSubstanceIncludedMaterials();
	static float GetSubstanceLoadingProgress();
	static TArray<class USubstanceGraphInstance*> GetSubstances(class UMaterialInterface* Material);
	static TArray<class UTexture2D*> GetSubstanceTextures(class USubstanceGraphInstance* GraphInstance);
	static void ResetInputParameters(class USubstanceGraphInstance* GraphInstance);
	static void SetGraphInstanceOutputSize(class USubstanceGraphInstance* GraphInstance, ESubstanceTextureSize Width, ESubstanceTextureSize Height);
	static void SetGraphInstanceOutputSizeInt(class USubstanceGraphInstance* GraphInstance, int32 Width, int32 Height);
	static void SyncRendering(class USubstanceGraphInstance* InstancesToRender);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SubstanceUtility")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SubstanceUtility")
	}
	static class USubstanceUtility* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubstanceUtility>();
	}
};
DUMPER7_ASSERTS_USubstanceUtility;

SDK_NAMESPACE_END
