#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIBP_ListData_ShopItem

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass UIBP_ListData_ShopItem.UIBP_ListData_ShopItem_C
// 0x0028 (0x0050 - 0x0028)
class UUIBP_ListData_ShopItem_C final : public UObject
{
public:
	class UUIW_Window_C*                          OwnerWindow;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   ID;                                                // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ULProduct*                              LProduct;                                          // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UUserWidget*                            EntryWidget;                                       // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScrollBox*                             ParentScrollBox;                                   // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UIBP_ListData_ShopItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIBP_ListData_ShopItem_C")
	}
	static class UUIBP_ListData_ShopItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIBP_ListData_ShopItem_C>();
	}
};
DUMPER7_ASSERTS_UUIBP_ListData_ShopItem_C;

SDK_NAMESPACE_END
