#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIBP_ListData_Command

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "CoreUObject_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass UIBP_ListData_Command.UIBP_ListData_Command_C
// 0x0058 (0x0080 - 0x0028)
class UUIBP_ListData_Command_C final : public UObject
{
public:
	class FString                                 Label;                                             // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 Catergory;                                         // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class FString>                         CommandLines;                                      // 0x0048(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FInputChord                            HotKey;                                            // 0x0058(0x0020)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	class UUIW_CommandBook_C*                     CommandBook;                                       // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UIBP_ListData_Command_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIBP_ListData_Command_C")
	}
	static class UUIBP_ListData_Command_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIBP_ListData_Command_C>();
	}
};
DUMPER7_ASSERTS_UUIBP_ListData_Command_C;

SDK_NAMESPACE_END
