#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIBP_ListData_OneStat

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"
#include "CoreUObject_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass UIBP_ListData_OneStat.UIBP_ListData_OneStat_C
// 0x0080 (0x00A8 - 0x0028)
class UUIBP_ListData_OneStat_C final : public UObject
{
public:
	class FName                                   ID;                                                // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   Label;                                             // 0x0030(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TSoftObjectPtr<class UTexture2D>              Icon;                                              // 0x0048(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   Value;                                             // 0x0070(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         Diff;                                              // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Divisor;                                           // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Decimal;                                           // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ELFirstStat>                           ChaUpPreviewStat;                                  // 0x0098(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UIBP_ListData_OneStat_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIBP_ListData_OneStat_C")
	}
	static class UUIBP_ListData_OneStat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIBP_ListData_OneStat_C>();
	}
};
DUMPER7_ASSERTS_UUIBP_ListData_OneStat_C;

SDK_NAMESPACE_END
