#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIBP_ButtonWithTooltip

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function UIBP_ButtonWithTooltip.UIBP_ButtonWithTooltip_C.SetCustomTooltip
// 0x0040 (0x0040 - 0x0000)
struct UIBP_ButtonWithTooltip_C_SetCustomTooltip final
{
public:
	class FText                                   ToolTipText_0;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIBP_ButtonWithTooltip_C_SetCustomTooltip;

// Function UIBP_ButtonWithTooltip.UIBP_ButtonWithTooltip_C.ShowTooltip
// 0x0040 (0x0040 - 0x0000)
struct UIBP_ButtonWithTooltip_C_ShowTooltip final
{
public:
	struct FGeometry                              CallFunc_GetTickSpaceGeometry_ReturnValue;         // 0x0000(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIBP_ButtonWithTooltip_C_ShowTooltip;

// Function UIBP_ButtonWithTooltip.UIBP_ButtonWithTooltip_C.HideTooltip
// 0x0008 (0x0008 - 0x0000)
struct UIBP_ButtonWithTooltip_C_HideTooltip final
{
public:
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIBP_ButtonWithTooltip_C_HideTooltip;

// Function UIBP_ButtonWithTooltip.UIBP_ButtonWithTooltip_C.GetCustomTooltipText
// 0x0018 (0x0018 - 0x0000)
struct UIBP_ButtonWithTooltip_C_GetCustomTooltipText final
{
public:
	class FText                                   ToolTipText_0;                                     // 0x0000(0x0018)(Parm, OutParm)
};
DUMPER7_ASSERTS_UIBP_ButtonWithTooltip_C_GetCustomTooltipText;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
