#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIBP_LRichKeyTextBlock

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function UIBP_LRichKeyTextBlock.UIBP_LRichKeyTextBlock_C.SetKeyText
// 0x0048 (0x0048 - 0x0000)
struct UIBP_LRichKeyTextBlock_C_SetKeyText final
{
public:
	class FText                                   Text_0;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_ReplaceKeyText_EditText;                  // 0x0018(0x0018)()
	TDelegate<void(bool bGamePad)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIBP_LRichKeyTextBlock_C_SetKeyText;

// Function UIBP_LRichKeyTextBlock.UIBP_LRichKeyTextBlock_C.UpdateText
// 0x0020 (0x0020 - 0x0000)
struct UIBP_LRichKeyTextBlock_C_UpdateText final
{
public:
	bool                                          bGamePad;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_ReplaceKeyText_EditText;                  // 0x0008(0x0018)()
};
DUMPER7_ASSERTS_UIBP_LRichKeyTextBlock_C_UpdateText;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
