#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Module_ResourceList

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function UIW_Module_ResourceList.UIW_Module_ResourceList_C.ExecuteUbergraph_UIW_Module_ResourceList
// 0x0004 (0x0004 - 0x0000)
struct UIW_Module_ResourceList_C_ExecuteUbergraph_UIW_Module_ResourceList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Module_ResourceList_C_ExecuteUbergraph_UIW_Module_ResourceList;

// Function UIW_Module_ResourceList.UIW_Module_ResourceList_C.SetData
// 0x0040 (0x0040 - 0x0000)
struct UIW_Module_ResourceList_C_SetData final
{
public:
	class FString                                 Title;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class UObject*>                        ListItems;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetGameStr_ReturnValue;                   // 0x0028(0x0018)()
};
DUMPER7_ASSERTS_UIW_Module_ResourceList_C_SetData;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
