#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Module_InfoText

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function UIW_Module_InfoText.UIW_Module_InfoText_C.SetModule
// 0x0018 (0x0018 - 0x0000)
struct UIW_Module_InfoText_C_SetModule final
{
public:
	class UUIW_Popup_C*                           PopupWindow_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Data;                                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Module_InfoText_C_SetModule;

// Function UIW_Module_InfoText.UIW_Module_InfoText_C.SetGameString
// 0x0028 (0x0028 - 0x0000)
struct UIW_Module_InfoText_C_SetGameString final
{
public:
	class FString                                 String;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStr_ReturnValue;                   // 0x0010(0x0018)()
};
DUMPER7_ASSERTS_UIW_Module_InfoText_C_SetGameString;

// Function UIW_Module_InfoText.UIW_Module_InfoText_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct UIW_Module_InfoText_C_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_UIW_Module_InfoText_C_SetText;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
