#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_FadeInOut

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass UIW_HUD_FadeInOut.UIW_HUD_FadeInOut_C
// 0x0028 (0x0288 - 0x0260)
class UUIW_HUD_FadeInOut_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_Black_Off;                                     // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Black_On;                                      // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Hide;                                          // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Show;                                          // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_HUD_FadeInOut(int32 EntryPoint);
	void WidgetAnimationEvt_Ani_Black_Off_K2Node_WidgetAnimationEvent_7();
	void WidgetAnimationEvt_Ani_Black_Off_K2Node_WidgetAnimationEvent_6();
	void WidgetAnimationEvt_Ani_Black_On_K2Node_WidgetAnimationEvent_5();
	void WidgetAnimationEvt_Ani_Black_On_K2Node_WidgetAnimationEvent_4();
	void WidgetAnimationEvt_Ani_Show_K2Node_WidgetAnimationEvent_1();
	void WidgetAnimationEvt_Ani_Hide_K2Node_WidgetAnimationEvent_3();
	void WidgetAnimationEvt_Ani_Hide_K2Node_WidgetAnimationEvent_2();
	void WidgetAnimationEvt_Ani_Show_K2Node_WidgetAnimationEvent_0();
	void Destruct();
	void Construct();
	void SoundFadeInEvent();
	void OnFadeIn();
	void OnFadeOut();
	void OnFadeBlackOn();
	void OnFadeBlackOff();
	void SequenceEvent__ENTRYPOINTUIW_HUD_FadeInOut_0();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UIW_HUD_FadeInOut_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIW_HUD_FadeInOut_C")
	}
	static class UUIW_HUD_FadeInOut_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_HUD_FadeInOut_C>();
	}
};
DUMPER7_ASSERTS_UUIW_HUD_FadeInOut_C;

SDK_NAMESPACE_END
