#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_Gauge_HP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectP_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass UIW_HUD_Gauge_HP.UIW_HUD_Gauge_HP_C
// 0x0048 (0x02E8 - 0x02A0)
class UUIW_HUD_Gauge_HP_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUIW_HUD_GaugeFX_C*                     Fx;                                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FX_Gradation;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Gauge_Fx_Paralyze_C*               FX_ParalyzeGroup;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HP;                                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RegainHP;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         InitSize;                                          // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALNPCCharacter*                         OwnerNPC;                                          // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsParalyzeDestructing;                             // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsParalyzeTime;                                    // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UIW_HUD_Gauge_HP(int32 EntryPoint);
	void Construct();
	void OnInitialized();
	void Destruct();
	void PreConstruct(bool IsDesignTime);
	void InitGauge();
	void SetGaugeColor(const struct FLinearColor& HPColor, const struct FLinearColor& FXGradationColor);
	void SetParalyze(class ALNPCCharacter* NPC, bool IsAbleParalyze);
	void SetGroggy();
	void ResetParalyze();
	void RefreshGauge(class ULStatComponent* StatComponent, bool NeedFxUpdate, bool NeedEffectUpdate, float CurrentPercent, bool NeedGaugeTween, float* GaugeSizeX);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UIW_HUD_Gauge_HP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIW_HUD_Gauge_HP_C")
	}
	static class UUIW_HUD_Gauge_HP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_HUD_Gauge_HP_C>();
	}
};
DUMPER7_ASSERTS_UUIW_HUD_Gauge_HP_C;

SDK_NAMESPACE_END
