#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_Narration

#include "Basic.hpp"

#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function UIW_HUD_Narration.UIW_HUD_Narration_C.ExecuteUbergraph_UIW_HUD_Narration
// 0x0030 (0x0030 - 0x0000)
struct UIW_HUD_Narration_C_ExecuteUbergraph_UIW_HUD_Narration final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsValid, class FText LocalizedText)> K2Node_CreateDelegate_OutputDelegate;   // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float VisibleTime, class FText LocalizedText)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
};
DUMPER7_ASSERTS_UIW_HUD_Narration_C_ExecuteUbergraph_UIW_HUD_Narration;

// Function UIW_HUD_Narration.UIW_HUD_Narration_C.Show
// 0x0008 (0x0008 - 0x0000)
struct UIW_HUD_Narration_C_Show final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_HUD_Narration_C_Show;

// Function UIW_HUD_Narration.UIW_HUD_Narration_C.Hide
// 0x0008 (0x0008 - 0x0000)
struct UIW_HUD_Narration_C_Hide final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_HUD_Narration_C_Hide;

// Function UIW_HUD_Narration.UIW_HUD_Narration_C.OnVisibleGuide
// 0x0020 (0x0020 - 0x0000)
struct UIW_HUD_Narration_C_OnVisibleGuide final
{
public:
	bool                                          IsValid;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   MsgText;                                           // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_UIW_HUD_Narration_C_OnVisibleGuide;

// Function UIW_HUD_Narration.UIW_HUD_Narration_C.OnTimerGuide
// 0x0028 (0x0028 - 0x0000)
struct UIW_HUD_Narration_C_OnTimerGuide final
{
public:
	float                                         VisibleTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   MsgText;                                           // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_HUD_Narration_C_OnTimerGuide;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
