#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Popup_Module

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function UIW_Popup_Module.UIW_Popup_Module_C.SetModule
// 0x0018 (0x0018 - 0x0000)
struct UIW_Popup_Module_C_SetModule final
{
public:
	class UUIW_Popup_C*                           PopupWindow_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Data;                                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Popup_Module_C_SetModule;

// Function UIW_Popup_Module.UIW_Popup_Module_C.OnActive
// 0x0008 (0x0008 - 0x0000)
struct UIW_Popup_Module_C_OnActive final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Popup_Module_C_OnActive;

// Function UIW_Popup_Module.UIW_Popup_Module_C.OnRepeat
// 0x0008 (0x0008 - 0x0000)
struct UIW_Popup_Module_C_OnRepeat final
{
public:
	class UUIW_Btn_Key_C*                         BtnKey;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Popup_Module_C_OnRepeat;

// Function UIW_Popup_Module.UIW_Popup_Module_C.FocusManage
// 0x0218 (0x0218 - 0x0000)
struct UIW_Popup_Module_C_FocusManage final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
DUMPER7_ASSERTS_UIW_Popup_Module_C_FocusManage;

// Function UIW_Popup_Module.UIW_Popup_Module_C.OnWheel
// 0x0004 (0x0004 - 0x0000)
struct UIW_Popup_Module_C_OnWheel final
{
public:
	float                                         Delta;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Popup_Module_C_OnWheel;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
