#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_SlaveArm_List

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function UIW_SlaveArm_List.UIW_SlaveArm_List_C.ExecuteUbergraph_UIW_SlaveArm_List
// 0x00E0 (0x00E0 - 0x0000)
struct UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0038(0x0028)()
	class FText                                   CallFunc_GetLocalTextTooltipLocalize_ReturnValue;  // 0x0060(0x0018)()
	class FName                                   CallFunc_GetLocalTextTooltipCn_ReturnValue;        // 0x0078(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalTextNameLocalize_ReturnValue;     // 0x0080(0x0018)()
	class FText                                   CallFunc_GetPlatformBranchTextSA_Text;             // 0x0098(0x0018)()
	bool                                          CallFunc_GetPlatformBranchTextSA_IsChanged;        // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x00B8(0x0028)()
};
DUMPER7_ASSERTS_UIW_SlaveArm_List_C_ExecuteUbergraph_UIW_SlaveArm_List;

// Function UIW_SlaveArm_List.UIW_SlaveArm_List_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_SlaveArm_List_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_SlaveArm_List_C_BP_OnItemSelectionChanged;

// Function UIW_SlaveArm_List.UIW_SlaveArm_List_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct UIW_SlaveArm_List_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_SlaveArm_List_C_BP_OnItemExpansionChanged;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
