#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_Menu_PouchSlot

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function UIW_HUD_Menu_PouchSlot.UIW_HUD_Menu_PouchSlot_C.ExecuteUbergraph_UIW_HUD_Menu_PouchSlot
// 0x00B0 (0x00B0 - 0x0000)
struct UIW_HUD_Menu_PouchSlot_C_ExecuteUbergraph_UIW_HUD_Menu_PouchSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0040(0x0070)(ConstParm)
};
DUMPER7_ASSERTS_UIW_HUD_Menu_PouchSlot_C_ExecuteUbergraph_UIW_HUD_Menu_PouchSlot;

// Function UIW_HUD_Menu_PouchSlot.UIW_HUD_Menu_PouchSlot_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UIW_HUD_Menu_PouchSlot_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_UIW_HUD_Menu_PouchSlot_C_OnMouseEnter;

// Function UIW_HUD_Menu_PouchSlot.UIW_HUD_Menu_PouchSlot_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
DUMPER7_ASSERTS_UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDown;

// Function UIW_HUD_Menu_PouchSlot.UIW_HUD_Menu_PouchSlot_C.OnMouseButtonDoubleClick
// 0x0218 (0x0218 - 0x0000)
struct UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDoubleClick final
{
public:
	struct FGeometry                              InMyGeometry;                                      // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InMouseEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0160(0x00B8)()
};
DUMPER7_ASSERTS_UIW_HUD_Menu_PouchSlot_C_OnMouseButtonDoubleClick;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
