#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Alert_SystemMessage

#include "Basic.hpp"

#include "ProjectP_structs.hpp"
#include "UIST_Time_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function UIW_Alert_SystemMessage.UIW_Alert_SystemMessage_C.ExecuteUbergraph_UIW_Alert_SystemMessage
// 0x00A0 (0x00A0 - 0x0000)
struct UIW_Alert_SystemMessage_C_ExecuteUbergraph_UIW_Alert_SystemMessage final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x0004(0x000C)(NoDestructor)
	struct FUIST_Time                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0010(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_1;                     // 0x002C(0x000C)(NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName CategoryName)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_2;                     // 0x0050(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_3;                     // 0x005C(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_4;                     // 0x0068(0x000C)(NoDestructor)
	class FName                                   K2Node_CustomEvent_CategoryName;                   // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Window_C*                          CallFunc_GetTopWindow_Window;                      // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_Inventory_C*                       K2Node_DynamicCast_AsUIW_Inventory;                // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_Alert_SystemMessage_C_ExecuteUbergraph_UIW_Alert_SystemMessage;

// Function UIW_Alert_SystemMessage.UIW_Alert_SystemMessage_C.Remove
// 0x0008 (0x0008 - 0x0000)
struct UIW_Alert_SystemMessage_C_Remove final
{
public:
	class FName                                   CategoryName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Alert_SystemMessage_C_Remove;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
