#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_Gauge_Frenzy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectP_structs.hpp"
#include "ProjectP_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass UIW_HUD_Gauge_Frenzy.UIW_HUD_Gauge_Frenzy_C
// 0x0058 (0x02F8 - 0x02A0)
class UUIW_HUD_Gauge_Frenzy_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         Group_Unit;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_HUD_Gauge_FrenzyItem_C*            Unit_0;                                            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_HUD_Gauge_FrenzyItem_C*            Unit_1;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_HUD_Gauge_FrenzyItem_C*            Unit_2;                                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_HUD_Gauge_FrenzyItem_C*            Unit_3;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_HUD_Gauge_FrenzyItem_C*            Unit_4;                                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_HUD_Gauge_FrenzyItem_C*            Unit_5;                                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UUIW_HUD_Gauge_FrenzyItem_C*>    UnitList;                                          // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         PrevUnitCount;                                     // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_HUD_Gauge_Frenzy(int32 EntryPoint);
	void Destruct();
	void Construct();
	void UpdateFrenzyPoint(int32 Current, int32 Max, int32 UnitCount, int32 ConsumeUnitCount, ELFrenzyConsumeReason FrenzyPointConsumeReason);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UIW_HUD_Gauge_Frenzy_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIW_HUD_Gauge_Frenzy_C")
	}
	static class UUIW_HUD_Gauge_Frenzy_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_HUD_Gauge_Frenzy_C>();
	}
};
DUMPER7_ASSERTS_UUIW_HUD_Gauge_Frenzy_C;

SDK_NAMESPACE_END
