#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Alert_Interaction

#include "Basic.hpp"

#include "ProjectP_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function UIW_Alert_Interaction.UIW_Alert_Interaction_C.ExecuteUbergraph_UIW_Alert_Interaction
// 0x0050 (0x0050 - 0x0000)
struct UIW_Alert_Interaction_C_ExecuteUbergraph_UIW_Alert_Interaction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsValid)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_CategoryName;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName CategoryName)>     K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool IsValid, class FName InteractMsg)> K2Node_CreateDelegate_OutputDelegate_2;   // 0x003C(0x0010)(ZeroConstructor, NoDestructor)
};
DUMPER7_ASSERTS_UIW_Alert_Interaction_C_ExecuteUbergraph_UIW_Alert_Interaction;

// Function UIW_Alert_Interaction.UIW_Alert_Interaction_C.CompleteTween
// 0x0008 (0x0008 - 0x0000)
struct UIW_Alert_Interaction_C_CompleteTween final
{
public:
	class FName                                   CategoryName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Alert_Interaction_C_CompleteTween;

// Function UIW_Alert_Interaction.UIW_Alert_Interaction_C.Show
// 0x001C (0x001C - 0x0000)
struct UIW_Alert_Interaction_C_Show final
{
public:
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x0000(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_1;                     // 0x000C(0x000C)(NoDestructor)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Alert_Interaction_C_Show;

// Function UIW_Alert_Interaction.UIW_Alert_Interaction_C.Hide
// 0x001C (0x001C - 0x0000)
struct UIW_Alert_Interaction_C_Hide final
{
public:
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x0000(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_1;                     // 0x000C(0x000C)(NoDestructor)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Alert_Interaction_C_Hide;

// Function UIW_Alert_Interaction.UIW_Alert_Interaction_C.SetInteraction
// 0x0028 (0x0028 - 0x0000)
struct UIW_Alert_Interaction_C_SetInteraction final
{
public:
	bool                                          IsValid;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   MsgCode_0;                                         // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetPlatformBranchTextInteraction_Text;    // 0x0010(0x0018)()
};
DUMPER7_ASSERTS_UIW_Alert_Interaction_C_SetInteraction;

// Function UIW_Alert_Interaction.UIW_Alert_Interaction_C.OnEnableInteraction
// 0x0001 (0x0001 - 0x0000)
struct UIW_Alert_Interaction_C_OnEnableInteraction final
{
public:
	bool                                          IsValid;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_Alert_Interaction_C_OnEnableInteraction;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
