#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_QA_ListItem

#include "Basic.hpp"

#include "ProjectPContentInfo_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass UIW_QA_ListItem.UIW_QA_ListItem_C
// 0x0020 (0x0280 - 0x0260)
class UUIW_QA_ListItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Btn;                                               // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ELSecondStat                                  SecondStat;                                        // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Index_0;                                           // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_QA_ListItem(int32 EntryPoint);
	void BndEvt__UIW_QA_ListItem_Btn_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UIW_QA_ListItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIW_QA_ListItem_C")
	}
	static class UUIW_QA_ListItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_QA_ListItem_C>();
	}
};
DUMPER7_ASSERTS_UUIW_QA_ListItem_C;

SDK_NAMESPACE_END
