#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Alert_Interaction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectP_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass UIW_Alert_Interaction.UIW_Alert_Interaction_C
// 0x0028 (0x02C8 - 0x02A0)
class UUIW_Alert_Interaction_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           EnableCanvas;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIBP_LRichKeyTextBlock_C*              KeyBindText;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   MsgCode;                                           // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShow;                                            // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UIW_Alert_Interaction(int32 EntryPoint);
	void CompleteTween(class FName CategoryName);
	void Destruct();
	void Construct();
	void Show();
	void Hide();
	void SetInteraction(bool IsValid, class FName MsgCode_0);
	void OnEnableInteraction(bool IsValid);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UIW_Alert_Interaction_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIW_Alert_Interaction_C")
	}
	static class UUIW_Alert_Interaction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Alert_Interaction_C>();
	}
};
DUMPER7_ASSERTS_UUIW_Alert_Interaction_C;

SDK_NAMESPACE_END
