#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Window

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ProjectP_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass UIW_Window.UIW_Window_C
// 0x00A8 (0x0348 - 0x02A0)
class UUIW_Window_C : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsEnabledWindow;                                   // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        ArrEnabledList;                                    // 0x02B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FName                                   WidgetRowName;                                     // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class FText>                ContextMenuList;                                   // 0x02C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDataTableRowHandle                    OpenSound;                                         // 0x0318(0x0010)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)
	struct FDataTableRowHandle                    CloseSound;                                        // 0x0328(0x0010)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)
	struct FVector2D                              ContextMenuPosition;                               // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsClosing;                                         // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsMouseDown;                                       // 0x0341(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UIW_Window(int32 EntryPoint);
	void Destruct();
	void Construct();
	void OnReady();
	void SetEnabledWindow(bool IsEnabled);
	struct FEventReply FocusManage(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void RequestCloseWindow();
	void Request_Open_Context_Menu(const struct FVector2D& position);
	void CallbackContextMenu(class FName EventName);
	void AddEventBinding();
	void ClearEventBinding();
	void OnCompleteTweenEvent(class FName Name_0);
	struct FEventReply OnMouseButtonUp(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UIW_Window_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIW_Window_C")
	}
	static class UUIW_Window_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Window_C>();
	}
};
DUMPER7_ASSERTS_UUIW_Window_C;

SDK_NAMESPACE_END
