#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_ControlGuide

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "ProjectPContentInfo_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass UIW_HUD_ControlGuide.UIW_HUD_ControlGuide_C
// 0x0038 (0x0298 - 0x0260)
class UUIW_HUD_ControlGuide_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUIW_Btn_Key_RIght_C*                   Btn_Change_LegionArm;                              // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_RIght_C*                   Btn_Change_Walk_OnlyPC;                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_RIght_C*                   Btn_Change_Weapon;                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_RIght_C*                   Btn_Guard;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_RIght_C*                   Btn_Pouch;                                         // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Btn_Key_RIght_C*                   Btn_Sprint;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_HUD_ControlGuide(int32 EntryPoint);
	void Destruct();
	void OnChangeInput(bool bGamePad);
	void Construct();
	void SetEnabledChangeSlaveArm();
	void SetEnabledChangeWeapon();
	void SetControlGuide(bool IsGamePad);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UIW_HUD_ControlGuide_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIW_HUD_ControlGuide_C")
	}
	static class UUIW_HUD_ControlGuide_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_HUD_ControlGuide_C>();
	}
};
DUMPER7_ASSERTS_UUIW_HUD_ControlGuide_C;

SDK_NAMESPACE_END
