#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_CharacterUpgrade_Stat

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function UIW_CharacterUpgrade_Stat.UIW_CharacterUpgrade_Stat_C.ExecuteUbergraph_UIW_CharacterUpgrade_Stat
// 0x0120 (0x0120 - 0x0000)
struct UIW_CharacterUpgrade_Stat_C_ExecuteUbergraph_UIW_CharacterUpgrade_Stat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0040(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00B0(0x0070)(ConstParm)
};
DUMPER7_ASSERTS_UIW_CharacterUpgrade_Stat_C_ExecuteUbergraph_UIW_CharacterUpgrade_Stat;

// Function UIW_CharacterUpgrade_Stat.UIW_CharacterUpgrade_Stat_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct UIW_CharacterUpgrade_Stat_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_UIW_CharacterUpgrade_Stat_C_OnMouseLeave;

// Function UIW_CharacterUpgrade_Stat.UIW_CharacterUpgrade_Stat_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct UIW_CharacterUpgrade_Stat_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_UIW_CharacterUpgrade_Stat_C_OnMouseEnter;

// Function UIW_CharacterUpgrade_Stat.UIW_CharacterUpgrade_Stat_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct UIW_CharacterUpgrade_Stat_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x00F8(0x00B8)()
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_CharacterUpgrade_Stat_C_OnFocusReceived;

// Function UIW_CharacterUpgrade_Stat.UIW_CharacterUpgrade_Stat_C.SetSelected
// 0x0058 (0x0058 - 0x0000)
struct UIW_CharacterUpgrade_Stat_C_SetSelected final
{
public:
	bool                                          IsSelected_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0028)()
};
DUMPER7_ASSERTS_UIW_CharacterUpgrade_Stat_C_SetSelected;

// Function UIW_CharacterUpgrade_Stat.UIW_CharacterUpgrade_Stat_C.OnMouseButtonUp
// 0x0218 (0x0218 - 0x0000)
struct UIW_CharacterUpgrade_Stat_C_OnMouseButtonUp final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0160(0x00B8)()
};
DUMPER7_ASSERTS_UIW_CharacterUpgrade_Stat_C_OnMouseButtonUp;

// Function UIW_CharacterUpgrade_Stat.UIW_CharacterUpgrade_Stat_C.GetSelected
// 0x0001 (0x0001 - 0x0000)
struct UIW_CharacterUpgrade_Stat_C_GetSelected final
{
public:
	bool                                          IsSelected_0;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_CharacterUpgrade_Stat_C_GetSelected;

// Function UIW_CharacterUpgrade_Stat.UIW_CharacterUpgrade_Stat_C.OnMouseWheel
// 0x0220 (0x0220 - 0x0000)
struct UIW_CharacterUpgrade_Stat_C_OnMouseWheel final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	float                                         CallFunc_PointerEvent_GetWheelDelta_ReturnValue;   // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0168(0x00B8)()
};
DUMPER7_ASSERTS_UIW_CharacterUpgrade_Stat_C_OnMouseWheel;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
