#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Popup

#include "Basic.hpp"

#include "UIW_Window_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass UIW_Popup.UIW_Popup_C
// 0x0050 (0x0398 - 0x0348)
class UUIW_Popup_C final : public UUIW_Window_C
{
public:
	class UCanvasPanel*                           Canvas_BG;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Contents_Group;                                    // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Panel_Contents;                                    // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Panel_Key;                                         // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   PopupRowName;                                      // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UUIW_Popup_C* Popup, class UUIW_Btn_Key_C* BtnKey)> OnActiveKey; // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UUIW_Popup_Module_C*>            ModuleList;                                        // 0x0380(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UUIW_Popup_BG_C*                        CurrentBG;                                         // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetPopup(class FName PopupRowName_0);
	void ActiveKey(class UUIW_Btn_Key_C* BtnKey);
	void RepeatKey(class UUIW_Btn_Key_C* BtnKey);
	struct FEventReply FocusManage(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void SetText(const class FString& Title, const class FText& Desc);
	void SetKeyHoldTime(float Time);
	void SetResource(const class FString& Title, TArray<class UObject*>& ListItems);
	void SetCostGain(TArray<class UObject*>& CostList, TArray<class UObject*>& GainList);
	void GetResourceListView(class UListView** ListView);
	void RequestCloseWindow();
	void SetContentsSize();
	struct FEventReply OnMouseWheel(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnCompleteTweenEvent(class FName Name_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UIW_Popup_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIW_Popup_C")
	}
	static class UUIW_Popup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Popup_C>();
	}
};
DUMPER7_ASSERTS_UUIW_Popup_C;

SDK_NAMESPACE_END
