#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_CharacterUpgrade_Button

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function UIW_CharacterUpgrade_Button.UIW_CharacterUpgrade_Button_C.ExecuteUbergraph_UIW_CharacterUpgrade_Button
// 0x000C (0x000C - 0x0000)
struct UIW_CharacterUpgrade_Button_C_ExecuteUbergraph_UIW_CharacterUpgrade_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0004(0x0008)(NoDestructor)
};
DUMPER7_ASSERTS_UIW_CharacterUpgrade_Button_C_ExecuteUbergraph_UIW_CharacterUpgrade_Button;

// Function UIW_CharacterUpgrade_Button.UIW_CharacterUpgrade_Button_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct UIW_CharacterUpgrade_Button_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_UIW_CharacterUpgrade_Button_C_OnFocusLost;

// Function UIW_CharacterUpgrade_Button.UIW_CharacterUpgrade_Button_C.OnFocusReceived
// 0x01B8 (0x01B8 - 0x0000)
struct UIW_CharacterUpgrade_Button_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x00F8(0x00B8)()
	class UUIW_Main_C*                            CallFunc_GetMainWidget_MainWidget;                 // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_CharacterUpgrade_Button_C_OnFocusReceived;

// Function UIW_CharacterUpgrade_Button.UIW_CharacterUpgrade_Button_C.OnEnabled
// 0x0001 (0x0001 - 0x0000)
struct UIW_CharacterUpgrade_Button_C_OnEnabled final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_CharacterUpgrade_Button_C_OnEnabled;

// Function UIW_CharacterUpgrade_Button.UIW_CharacterUpgrade_Button_C.SetLabel
// 0x0020 (0x0020 - 0x0000)
struct UIW_CharacterUpgrade_Button_C_SetLabel final
{
public:
	class FName                                   CodeName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0008(0x0018)()
};
DUMPER7_ASSERTS_UIW_CharacterUpgrade_Button_C_SetLabel;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
