#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_SecondTitle_Icon

#include "Basic.hpp"

#include "ProjectP_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function UIW_SecondTitle_Icon.UIW_SecondTitle_Icon_C.ExecuteUbergraph_UIW_SecondTitle_Icon
// 0x0004 (0x0004 - 0x0000)
struct UIW_SecondTitle_Icon_C_ExecuteUbergraph_UIW_SecondTitle_Icon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_SecondTitle_Icon_C_ExecuteUbergraph_UIW_SecondTitle_Icon;

// Function UIW_SecondTitle_Icon.UIW_SecondTitle_Icon_C.SetData
// 0x0028 (0x0028 - 0x0000)
struct UIW_SecondTitle_Icon_C_SetData final
{
public:
	class UTexture2D*                             Icon;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Label;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x0010(0x0018)()
};
DUMPER7_ASSERTS_UIW_SecondTitle_Icon_C_SetData;

// Function UIW_SecondTitle_Icon.UIW_SecondTitle_Icon_C.SetSelected
// 0x0038 (0x0038 - 0x0000)
struct UIW_SecondTitle_Icon_C_SetSelected final
{
public:
	bool                                          IsSelected_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x0004(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_1;                     // 0x0010(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_2;                     // 0x001C(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_3;                     // 0x0028(0x000C)(NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_SecondTitle_Icon_C_SetSelected;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
