#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Alert_GetItem

#include "Basic.hpp"

#include "UIST_FirstCategoryInfo_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"
#include "UIST_GetItem_structs.hpp"
#include "UIST_Time_structs.hpp"
#include "ProjectP_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function UIW_Alert_GetItem.UIW_Alert_GetItem_C.ExecuteUbergraph_UIW_Alert_GetItem
// 0x0070 (0x0070 - 0x0000)
struct UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIST_Time                             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName CategoryName)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x0040(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_1;                     // 0x004C(0x000C)(NoDestructor)
	class FName                                   K2Node_CustomEvent_CategoryName;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Alert_GetItem_C_ExecuteUbergraph_UIW_Alert_GetItem;

// Function UIW_Alert_GetItem.UIW_Alert_GetItem_C.CompleteTween
// 0x0008 (0x0008 - 0x0000)
struct UIW_Alert_GetItem_C_CompleteTween final
{
public:
	class FName                                   CategoryName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Alert_GetItem_C_CompleteTween;

// Function UIW_Alert_GetItem.UIW_Alert_GetItem_C.SetItem
// 0x0188 (0x0188 - 0x0000)
struct UIW_Alert_GetItem_C_SetItem final
{
public:
	struct FUIST_GetItem                          GetItem;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWeapon_ReturnValue;                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ULWeaponItem*                           K2Node_DynamicCast_AsLWeapon_Item;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ELItemFirstCategory                           CallFunc_GetFirstCategory_ReturnValue;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemCommonInfoPtr                     CallFunc_GetHandleCommonInfo_ReturnValue;          // 0x0040(0x0008)(NoDestructor)
	struct FItemCommonInfoPtr                     CallFunc_GetBladeCommonInfo_ReturnValue;           // 0x0048(0x0008)(NoDestructor)
	TSoftObjectPtr<class UObject>                 CallFunc_GetImageResource_ReturnValue;             // 0x0050(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 CallFunc_GetImageResource_ReturnValue_1;           // 0x0078(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsHeroicWeapon_ReturnValue;               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FItemCommonInfoPtr                     CallFunc_GetCommonInfo_ReturnValue;                // 0x00A8(0x0008)(NoDestructor)
	TSoftObjectPtr<class UObject>                 CallFunc_GetHeroicWeaponImageResource_ReturnValue; // 0x00B0(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	struct FItemCommonInfoPtr                     CallFunc_GetCommonInfo_ReturnValue_1;              // 0x00D8(0x0008)(NoDestructor)
	class FText                                   CallFunc_GetLocalTextItemNameLocalize_ReturnValue; // 0x00E0(0x0018)()
	TSoftObjectPtr<class UObject>                 CallFunc_GetImageResource_ReturnValue_2;           // 0x00F8(0x0028)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	TMap<ELItemFirstCategory, struct FUIST_FirstCategoryInfo> CallFunc_GetFirstCategoryInfo_FirstCategoryInfo; // 0x0120(0x0050)()
	struct FUIST_FirstCategoryInfo                CallFunc_Map_Find_Value;                           // 0x0170(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_Alert_GetItem_C_SetItem;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
