#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_HUD_QuickSlot

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "ProjectP_structs.hpp"
#include "ProjectPContentInfo_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.ExecuteUbergraph_UIW_HUD_QuickSlot
// 0x0230 (0x0230 - 0x0000)
struct UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLUseItemSlot                          CallFunc_GetChosenUseItem_ReturnValue;             // 0x0020(0x0014)(NoDestructor)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FLUseItemSlot& UseSlot)> K2Node_CreateDelegate_OutputDelegate;       // 0x0044(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool IsFirstLine, int32 SlotIndex, class FName OldItemCodeName, class FName NewItemCodeName)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool IsValid)>                 K2Node_CreateDelegate_OutputDelegate_2;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUIW_DPad_Item_C*>               K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void(ELAssistUseItemSlotType SlotType, class FName OldItemCodeName, class FName NewItemCodeName)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool IsValid)>                 K2Node_CreateDelegate_OutputDelegate_4;            // 0x0098(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ELShotGunAmmoType Type)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x00AC(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FLEquipItemSlot& SlaveArmSlot)> K2Node_CreateDelegate_OutputDelegate_6; // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName MainItemCodeName, class FName UnitItemCodeName)> K2Node_CreateDelegate_OutputDelegate_7; // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName CategoryName)>     K2Node_CreateDelegate_OutputDelegate_8;            // 0x00E0(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   CallFunc_GetGameStrWithName_ReturnValue;           // 0x00F0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UUIW_DPad_Item_C*                       CallFunc_Array_Get_Item;                           // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0138(0x0018)()
	class UUIW_DPad_Item_C*                       CallFunc_Array_Get_Item_1;                         // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_DPad_Item_C*                       CallFunc_Array_Get_Item_2;                         // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsEnabled)>               K2Node_CreateDelegate_OutputDelegate_9;            // 0x016C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsEnabled)>               K2Node_CreateDelegate_OutputDelegate_10;           // 0x0184(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsEnabled)>               K2Node_CreateDelegate_OutputDelegate_11;           // 0x019C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePadMode_ReturnValue;                // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUIW_DPad_Item_C*>               K2Node_MakeArray_Array_1;                          // 0x01C8(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UUIW_DPad_Item_C*>               K2Node_MakeArray_Array_2;                          // 0x01D8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerInventory*                      CallFunc_GetPlayerInventory_ReturnValue;           // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue_1;         // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class ULItem* Item)>           K2Node_CreateDelegate_OutputDelegate_12;           // 0x0208(0x0010)(ZeroConstructor, NoDestructor)
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bGamePad)>                K2Node_CreateDelegate_OutputDelegate_13;           // 0x0220(0x0010)(ZeroConstructor, NoDestructor)
};
DUMPER7_ASSERTS_UIW_HUD_QuickSlot_C_ExecuteUbergraph_UIW_HUD_QuickSlot;

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.OnChooseItem
// 0x0014 (0x0014 - 0x0000)
struct UIW_HUD_QuickSlot_C_OnChooseItem final
{
public:
	struct FLUseItemSlot                          UseSlot;                                           // 0x0000(0x0014)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
DUMPER7_ASSERTS_UIW_HUD_QuickSlot_C_OnChooseItem;

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.OnChangeItem
// 0x001C (0x001C - 0x0000)
struct UIW_HUD_QuickSlot_C_OnChangeItem final
{
public:
	bool                                          IsFirstLine;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SlotIndex;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   OldItemCodeName;                                   // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NewItemCodeName;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_HUD_QuickSlot_C_OnChangeItem;

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.RefreshBelt
// 0x00C0 (0x00C0 - 0x0000)
struct UIW_HUD_QuickSlot_C_RefreshBelt final
{
public:
	TArray<struct FLUseItemSlot>                  LocalUseItemSlotList;                              // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsEnabled)>               K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(bool IsEnabled)>               K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLUseItemSlot>                  CallFunc_GetUseSlotsLine_ReturnValue;              // 0x0050(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue_1;         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FLUseItemSlot>                  CallFunc_GetUseSlotsLine_ReturnValue_1;            // 0x0080(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_DPad_Item_C*                       CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_DPad_Item_C*                       CallFunc_Array_Get_Item_1;                         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_HUD_QuickSlot_C_RefreshBelt;

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.RefreshPouch
// 0x0070 (0x0070 - 0x0000)
struct UIW_HUD_QuickSlot_C_RefreshPouch final
{
public:
	TArray<ELAssistUseItemSlotType>               LocalPouchSlotType;                                // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ELAssistUseItemSlotType>               K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm)
	TDelegate<void(bool IsEnabled)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ELAssistUseItemSlotType                       CallFunc_Array_Get_Item;                           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetAssistUseItemCodeName_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_DPad_Item_C*                       CallFunc_Array_Get_Item_1;                         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_HUD_QuickSlot_C_RefreshPouch;

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.OnPressPouchKey
// 0x015C (0x015C - 0x0000)
struct UIW_HUD_QuickSlot_C_OnPressPouchKey final
{
public:
	bool                                          IsValid;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x0004(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_1;                     // 0x0010(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_2;                     // 0x001C(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_3;                     // 0x0028(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_4;                     // 0x0034(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_5;                     // 0x0040(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_6;                     // 0x004C(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_7;                     // 0x0058(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_8;                     // 0x0064(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_9;                     // 0x0070(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_10;                    // 0x007C(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_11;                    // 0x0088(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_12;                    // 0x0094(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_13;                    // 0x00A0(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_14;                    // 0x00AC(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_15;                    // 0x00B8(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_16;                    // 0x00C4(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_17;                    // 0x00D0(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_18;                    // 0x00DC(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_19;                    // 0x00E8(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_20;                    // 0x00F4(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_21;                    // 0x0100(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_22;                    // 0x010C(0x000C)(NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_23;                    // 0x011C(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_24;                    // 0x0128(0x000C)(NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_25;                    // 0x0138(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_26;                    // 0x0144(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_27;                    // 0x0150(0x000C)(NoDestructor)
};
DUMPER7_ASSERTS_UIW_HUD_QuickSlot_C_OnPressPouchKey;

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.OnPressShotgunAmmo
// 0x00F8 (0x00F8 - 0x0000)
struct UIW_HUD_QuickSlot_C_OnPressShotgunAmmo final
{
public:
	bool                                          IsValid;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x0004(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_1;                     // 0x0010(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_2;                     // 0x001C(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_3;                     // 0x0028(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_4;                     // 0x0034(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_5;                     // 0x0040(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_6;                     // 0x004C(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_7;                     // 0x0058(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_8;                     // 0x0064(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_9;                     // 0x0070(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_10;                    // 0x007C(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_11;                    // 0x0088(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_12;                    // 0x0094(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_13;                    // 0x00A0(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_14;                    // 0x00AC(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_15;                    // 0x00B8(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_16;                    // 0x00C4(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_17;                    // 0x00D0(0x000C)(NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_18;                    // 0x00E0(0x000C)(NoDestructor)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase_19;                    // 0x00EC(0x000C)(NoDestructor)
};
DUMPER7_ASSERTS_UIW_HUD_QuickSlot_C_OnPressShotgunAmmo;

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.OnChangePouch
// 0x0014 (0x0014 - 0x0000)
struct UIW_HUD_QuickSlot_C_OnChangePouch final
{
public:
	ELAssistUseItemSlotType                       SlotType;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   OldItemCodeName;                                   // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NewItemCodeName;                                   // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_HUD_QuickSlot_C_OnChangePouch;

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.OnChangeShotgunAmmo
// 0x0001 (0x0001 - 0x0000)
struct UIW_HUD_QuickSlot_C_OnChangeShotgunAmmo final
{
public:
	ELShotGunAmmoType                             Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_HUD_QuickSlot_C_OnChangeShotgunAmmo;

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.OnChooseSlaveArm
// 0x0050 (0x0050 - 0x0000)
struct UIW_HUD_QuickSlot_C_OnChooseSlaveArm final
{
public:
	struct FLEquipItemSlot                        SlaveArmSlot;                                      // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	class ULItemSystem*                           CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULPlayerEquipment*                      CallFunc_GetPlayerEquipment_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLEquipItemSlot                        CallFunc_GetChosenSlaveArmItem_ReturnValue;        // 0x0028(0x0018)(NoDestructor)
	class ULSlaveArmItem*                         K2Node_DynamicCast_AsLSlave_Arm_Item;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShotGunSlavearm_ReturnValue;            // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_HUD_QuickSlot_C_OnChooseSlaveArm;

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.OnChangeInputMode
// 0x0001 (0x0001 - 0x0000)
struct UIW_HUD_QuickSlot_C_OnChangeInputMode final
{
public:
	bool                                          IsGamePad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_HUD_QuickSlot_C_OnChangeInputMode;

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.GuideGrinderTransition
// 0x0090 (0x0090 - 0x0000)
struct UIW_HUD_QuickSlot_C_GuideGrinderTransition final
{
public:
	bool                                          IsShowCheck;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          LocalSelectedComplexItem;                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   LocalKey;                                          // 0x0008(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UUIW_DPad_Item_C*                       LocalComplexDpadItem;                              // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x0028(0x000C)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsComplexGrinder_Bool;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIW_DPad_Item_C*                       CallFunc_GetComplexPouchItem_Pouch;                // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Key_IsValid_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULPlayInputSystem*                      CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGamePadMode_ReturnValue;                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           CallFunc_GetInputKeyForAction_ReturnValue;         // 0x0058(0x0010)(ReferenceParm)
	struct FKey                                   CallFunc_GetPouchKey_Key;                          // 0x0068(0x0018)(HasGetValueTypeHash)
	TArray<struct FKey>                           CallFunc_GetInputKeyForAction_ReturnValue_1;       // 0x0080(0x0010)(ReferenceParm)
};
DUMPER7_ASSERTS_UIW_HUD_QuickSlot_C_GuideGrinderTransition;

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.OnChangeComplex
// 0x0014 (0x0014 - 0x0000)
struct UIW_HUD_QuickSlot_C_OnChangeComplex final
{
public:
	class FName                                   MainItemCodeName;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   UnitItemCodeName;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_HUD_QuickSlot_C_OnChangeComplex;

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.OnTweenComplete
// 0x0008 (0x0008 - 0x0000)
struct UIW_HUD_QuickSlot_C_OnTweenComplete final
{
public:
	class FName                                   CategoryName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_HUD_QuickSlot_C_OnTweenComplete;

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.GetComplexPouchItem
// 0x0038 (0x0038 - 0x0000)
struct UIW_HUD_QuickSlot_C_GetComplexPouchItem final
{
public:
	class UUIW_DPad_Item_C*                       Pouch_0;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_DPad_Item_C*                       LocalPouch;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_DPad_Item_C*                       CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsComplexGrinder_Bool;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_HUD_QuickSlot_C_GetComplexPouchItem;

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.OnTransitionEnabledChange
// 0x0001 (0x0001 - 0x0000)
struct UIW_HUD_QuickSlot_C_OnTransitionEnabledChange final
{
public:
	bool                                          IsEnabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_HUD_QuickSlot_C_OnTransitionEnabledChange;

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.OnUpdateItem
// 0x0008 (0x0008 - 0x0000)
struct UIW_HUD_QuickSlot_C_OnUpdateItem final
{
public:
	class ULItem*                                 Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_HUD_QuickSlot_C_OnUpdateItem;

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.SetUseGuide
// 0x0010 (0x0010 - 0x0000)
struct UIW_HUD_QuickSlot_C_SetUseGuide final
{
public:
	class UUIW_Btn_Key_C*                         LocalUseBtn;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_HUD_QuickSlot_C_SetUseGuide;

// Function UIW_HUD_QuickSlot.UIW_HUD_QuickSlot_C.SetControlGuide
// 0x0060 (0x0060 - 0x0000)
struct UIW_HUD_QuickSlot_C_SetControlGuide final
{
public:
	bool                                          IsGamePad;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FKey>                           CallFunc_GetInputKeyForAction_ReturnValue;         // 0x0008(0x0010)(ReferenceParm)
	TArray<struct FKey>                           CallFunc_GetInputKeyForAction_ReturnValue_1;       // 0x0018(0x0010)(ReferenceParm)
	TArray<struct FKey>                           CallFunc_GetInputKeyForAction_ReturnValue_2;       // 0x0028(0x0010)(ReferenceParm)
	TArray<struct FKey>                           CallFunc_GetInputKeyForAction_ReturnValue_3;       // 0x0038(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIW_DPad_Item_C*                       CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_HUD_QuickSlot_C_SetControlGuide;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
