#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_ProfileItem_GoldenTree

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ProjectP_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass UIW_ProfileItem_GoldenTree.UIW_ProfileItem_GoldenTree_C
// 0x0030 (0x02D0 - 0x02A0)
class UUIW_ProfileItem_GoldenTree_C final : public ULWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG_Shadow_0;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_Shadow_1;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIBP_ButtonWithTooltip_C*              Btn;                                               // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIW_Fx_Btn_Hover_C*                    Fx_Hover;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Value;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_ProfileItem_GoldenTree(int32 EntryPoint);
	void BndEvt__UIW_ProfileItem_Ergo_Btn_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UIW_ProfileItem_Ergo_Btn_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void Destruct();
	void Construct();
	void OnGoldenTree();
	void OnUpdateItem(class ULItem* Item);
	void SetIsHUD();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UIW_ProfileItem_GoldenTree_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIW_ProfileItem_GoldenTree_C")
	}
	static class UUIW_ProfileItem_GoldenTree_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_ProfileItem_GoldenTree_C>();
	}
};
DUMPER7_ASSERTS_UUIW_ProfileItem_GoldenTree_C;

SDK_NAMESPACE_END
