#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_PackageDownload

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass UIW_PackageDownload.UIW_PackageDownload_C
// 0x0028 (0x0288 - 0x0260)
class UUIW_PackageDownload_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Progress;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Percent;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Title;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           DownloadTimer;                                     // 0x0280(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_PackageDownload(int32 EntryPoint);
	void Destruct();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void SetProgress(float Value);
	void OnVisibillityChanged(ESlateVisibility InVisibility);
	void RefreshDownload();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UIW_PackageDownload_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIW_PackageDownload_C")
	}
	static class UUIW_PackageDownload_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_PackageDownload_C>();
	}
};
DUMPER7_ASSERTS_UUIW_PackageDownload_C;

SDK_NAMESPACE_END
