#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Gauge_Fx_Paralyze

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass UIW_Gauge_Fx_Paralyze.UIW_Gauge_Fx_Paralyze_C
// 0x0038 (0x0298 - 0x0260)
class UUIW_Gauge_Fx_Paralyze_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Ani_End_Success;                                   // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_End_Fail;                                      // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Idle;                                          // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ani_Start;                                         // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           Group_Paralyze;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       CurrentAnimation;                                  // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UIW_Gauge_Fx_Paralyze(int32 EntryPoint);
	void WidgetAnimationEvt_Ani_Start_K2Node_WidgetAnimationEvent_0();
	void OnIdleEnd();
	void AnimParalize(int32 Phase);
	void SequenceEvent__ENTRYPOINTUIW_Gauge_Fx_Paralyze_0();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UIW_Gauge_Fx_Paralyze_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIW_Gauge_Fx_Paralyze_C")
	}
	static class UUIW_Gauge_Fx_Paralyze_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIW_Gauge_Fx_Paralyze_C>();
	}
};
DUMPER7_ASSERTS_UUIW_Gauge_Fx_Paralyze_C;

SDK_NAMESPACE_END
