#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIW_Monologue

#include "Basic.hpp"

#include "ProjectP_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function UIW_Monologue.UIW_Monologue_C.ExecuteUbergraph_UIW_Monologue
// 0x0040 (0x0040 - 0x0000)
struct UIW_Monologue_C_ExecuteUbergraph_UIW_Monologue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName CategoryName)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULEventDispatcherSystem*                CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FText TextData)>         K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
};
DUMPER7_ASSERTS_UIW_Monologue_C_ExecuteUbergraph_UIW_Monologue;

// Function UIW_Monologue.UIW_Monologue_C.OnPlay
// 0x0028 (0x0028 - 0x0000)
struct UIW_Monologue_C_OnPlay final
{
public:
	class FText                                   TextData;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x0018(0x000C)(NoDestructor)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Monologue_C_OnPlay;

// Function UIW_Monologue.UIW_Monologue_C.OnStop
// 0x0010 (0x0010 - 0x0000)
struct UIW_Monologue_C_OnStop final
{
public:
	struct FTweenEase                             K2Node_MakeStruct_TweenEase;                       // 0x0000(0x000C)(NoDestructor)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UIW_Monologue_C_OnStop;

// Function UIW_Monologue.UIW_Monologue_C.CompleteTween
// 0x000C (0x000C - 0x0000)
struct UIW_Monologue_C_CompleteTween final
{
public:
	class FName                                   CategoryName;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UIW_Monologue_C_CompleteTween;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
