#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WorldSystemDataBP

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WorldSystemDataBP.WorldSystemDataBP_C.ExecuteUbergraph_WorldSystemDataBP
// 0x0020 (0x0020 - 0x0000)
struct WorldSystemDataBP_C_ExecuteUbergraph_WorldSystemDataBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_TeleportCodeName;                     // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInGameLoadingScreen;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ULWorldSystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULWorldSystem*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WorldSystemDataBP_C_ExecuteUbergraph_WorldSystemDataBP;

// Function WorldSystemDataBP.WorldSystemDataBP_C.ProcessMoveToTeleportSpotSameLevel
// 0x000C (0x000C - 0x0000)
struct WorldSystemDataBP_C_ProcessMoveToTeleportSpotSameLevel final
{
public:
	class FName                                   TeleportCodeName;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInGameLoadingScreen;                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WorldSystemDataBP_C_ProcessMoveToTeleportSpotSameLevel;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
